<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>关于 - 只是胡闹</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">


<link rel="stylesheet" href="/css/outdatedbrowser.css">





<meta name="description" content="">







<link rel="alternative" href="/atom.xml" title="关于" type="application/atom+xml">




<!--<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">-->

<link rel="stylesheet" href="/css/bulma.css">




<link rel="stylesheet" href="/css/lightgallery.css">


<link rel="stylesheet" href="/css/justifiedGallery.css">




<link rel="stylesheet" href="/css/atom-one-light.css">



<link rel="stylesheet" href="/css/style.css">



<script src="/js/fontawesome-all.js"></script>




<meta name="generator" content="Hexo 5.0.2"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    <img src="/images/logo.png" alt="" height="28">
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/life">生活</a>
            
            <a class="navbar-item "
               href="/categories/book">读书</a>
            
            <a class="navbar-item "
               href="/categories/music">爱乐</a>
            
            <a class="navbar-item "
               href="/categories/art">品艺</a>
            
            <a class="navbar-item "
               href="/categories/movie">观影</a>
            
            <a class="navbar-item "
               href="/categories/technology">探技</a>
            
            <a class="navbar-item "
               href="/categories/story">故事</a>
            
            <a class="navbar-item "
               href="/archives">所有文章</a>
            
            <a class="navbar-item is-active"
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/ppoffice/hexo-theme-minos">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            关于
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-21T19:59:33.000Z" itemprop="datePublished">8月 22 2020</time>
            
        </span>
        
        
        <span class="column is-narrow">
            
            
            9 分钟 读完 (约 1320 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><blockquote><p>&#x56DB;&#x5341;&#x5C81;&#x662F;&#x4E00;&#x4E2A;&#x5D2D;&#x65B0;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<footer><strong>&#x677E;&#x6D66;&#x5F25;&#x592A;&#x90CE;</strong></footer></blockquote>

<p>&#x56DB;&#x5341;&#x5C81;&#x7684;&#x6211;&#xFF0C;&#x5373;&#x5C06;&#x6B65;&#x5165;&#x751F;&#x547D;&#x7684;&#x7B2C;&#x56DB;&#x5341;&#x4E00;&#x4E2A;&#x5E74;&#x5934;&#x3002;</p>
<p>&#x53E4;&#x4E91;&#x56DB;&#x5341;&#x4E0D;&#x60D1;&#xFF0C;&#x56DB;&#x5341;&#x5C81;&#x8FD8;&#x4F9D;&#x65E7;&#x8FF7;&#x832B;&#x7684;&#x4EBA;&#x751F;&#x662F;&#x4E0D;&#x53CA;&#x683C;&#x7684;&#x3002;&#x56DE;&#x671B;&#x6211;&#x7684;&#x8FC7;&#x53BB;&#x56DB;&#x5341;&#x5E74;&#xFF0C;&#x786E;&#x5B9E;&#x6709;&#x592A;&#x591A;&#x9700;&#x8981;&#x5FCF;&#x6094;&#xFF1A;&#x4E00;&#x8EAB;&#x75FC;&#x75BE;&#xFF0C;&#x597D;&#x9038;&#x6076;&#x52B3;&#xFF0C;&#x4EE5;&#x81F4;&#x4E8E;&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#x4ECD;&#x65E7;&#x5C45;&#x65E0;&#x5B9A;&#x6240;&#xFF0C;&#x65E0;&#x4E8B;&#x4E1A;&#x4EE5;&#x5C31;&#x529F;&#x540D;&#xFF0C;&#x65E0;&#x4F34;&#x4FA3;&#x4EE5;&#x6170;&#x8EAB;&#x5FC3;&#xFF0C;&#x66F4;&#x65E0;&#x5B50;&#x55E3;&#x4EE5;&#x4EAB;&#x5929;&#x4F26;&#xFF0C;&#x6240;&#x8C13;&#x4E09;&#x65E0;&#x4E2D;&#x5E74;&#x662F;&#x4E5F;&#x3002;&#x5982;&#x6B64;&#x8BF4;&#x6765;&#xFF0C;&#x6211;&#x7ADF;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x503C;&#x5F97;&#x8BB0;&#x4E0B;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x5E86;&#x5E78;&#x7684;&#x662F;&#x6211;&#x4ECD;&#x65E7;&#x6709;&#x4E00;&#x9897;&#x6E34;&#x671B;&#x63A2;&#x7A76;&#x4E16;&#x754C;&#x7684;&#x5B69;&#x7AE5;&#x4E4B;&#x5FC3;&#x3001;&#x5BF9;&#x751F;&#x6D3B;&#x7684;&#x70ED;&#x7231;&#x4EE5;&#x53CA;&#x548C;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x671F;&#x8BB8;&#xFF0C;&#x800C;&#x6211;&#x6240;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x6216;&#x8BB8;&#x53EA;&#x662F;&#x66F4;&#x591A;&#x4E00;&#x4E9B;&#x7684;&#x884C;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x6211;&#x7684;&#x4E00;&#x4F4D;&#x597D;&#x53CB;&#x5728;&#x4ED6;&#x56DB;&#x5341;&#x5C81;&#x751F;&#x65E5;&#x4E4B;&#x9645;&#xFF0C;&#x9690;&#x5C45;&#x4E09;&#x65E5;&#xFF0C;&#x4EE5;&#x6C42;&#x9762;&#x58C1;&#x601D;&#x8FC7;&#xFF0C;&#x5410;&#x6545;&#x7EB3;&#x65B0;&#x3002;&#x6211;&#x656C;&#x4EF0;&#x4ED6;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5374;&#x4E0D;&#x5FC5;&#x6548;&#x4EFF;&#x3002;&#x6211;&#x662F;&#x4EAB;&#x4E50;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x6DF1;&#x4FE1;&#x53EA;&#x6709;&#x5956;&#x52B1;&#x624D;&#x80FD;&#x5E26;&#x6765;&#x79EF;&#x6781;&#x7684;&#x6548;&#x679C;&#x3002;&#x6B63;&#x5982;&#x4E00;&#x4E2A;&#x7CBE;&#x7F8E;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x6216;&#x8BB8;&#x5C31;&#x80FD;&#x6FC0;&#x53D1;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#x4F5C;&#x7684;&#x6B32;&#x671B;&#xFF0C;&#x6211;&#x5F00;&#x901A;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#xFF0C;&#x4F5C;&#x4E3A;&#x9001;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x56DB;&#x5341;&#x5C81;&#x751F;&#x65E5;&#x793C;&#x7269;&#x3002;</p>
<h3 id="&#x5173;&#x4E8E;&#x6211;"><a href="#&#x5173;&#x4E8E;&#x6211;" class="headerlink" title="&#x5173;&#x4E8E;&#x6211;"></a>&#x5173;&#x4E8E;&#x6211;</h3><p>&#x505A;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#x662F;&#x4E00;&#x4EF6;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x53E5;&#x51A0;&#x5195;&#x5802;&#x7687;&#x7684;&#x8BF4;&#x8BCD;&#xFF0C;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x5F53;&#x4E8B;&#x4EBA;&#x5F80;&#x5F80;&#x6709;&#x8BB8;&#x591A;&#x96BE;&#x8A00;&#x4E4B;&#x9690;&#x4E0D;&#x8DB3;&#x4E3A;&#x5916;&#x4EBA;&#x9053;&#x3002;&#xFF09;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x6211;&#x7684;&#x51E0;&#x6BB5;&#x91CD;&#x8981;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x80FD;&#x90E8;&#x5206;&#x5730;&#x89E3;&#x91CA;&#x4E3A;&#x4F55;&#x8FD9;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x5982;&#x6B64;&#x9C7C;&#x9F99;&#x6DF7;&#x6742;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5C11;&#x5E74;&#x65F6;&#x7684;&#x6211;&#x5B66;&#x4E60;&#x5E76;&#x4E0D;&#x7B97;&#x592A;&#x5DEE;&#xFF0C;&#x9AD8;&#x4E2D;&#x4EE5;&#x524D;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7528;&#x540D;&#x5217;&#x524D;&#x8305;&#x6765;&#x5F62;&#x5BB9;&#xFF0C;&#x7136;&#x800C;&#x6211;&#x5728;&#x521D;&#x4E2D;&#x548C;&#x9AD8;&#x4E2D;&#x5374;&#x5206;&#x522B;&#x6709;&#x8FC7;&#x4E00;&#x6B21;&#x9003;&#x5B66;&#x7ECF;&#x5386;&#x3002;&#x7ECF;&#x8FC7;&#x4E00;&#x756A;&#x66F2;&#x6298;&#xFF0C;&#x6211;&#x6700;&#x7EC8;&#x8003;&#x5165;&#x4E00;&#x6240;&#x666E;&#x901A;&#x7684;&#x827A;&#x672F;&#x9662;&#x6821;&#x7F8E;&#x672F;&#x7CFB;&#x5B66;&#x4E60;&#x4E2D;&#x56FD;&#x753B;&#x4E13;&#x4E1A;&#x3002;</p>
<p>&#x6BD5;&#x4E1A;&#x540E;&#x6211;&#x5F00;&#x59CB;&#x4ECE;&#x4E8B;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#xFF08;&#x4FD7;&#x79F0;&#x201C;&#x7F8E;&#x5DE5;&#x201D;&#xFF09;&#x3002;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x672C;&#x8EAB;&#x5E26;&#x6709;&#x4E00;&#x4E9B;&#x201C;&#x8DE8;&#x754C;&#x201D;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#x65E2;&#x8981;&#x6709;&#x827A;&#x672F;&#x8BBE;&#x8BA1;&#x80FD;&#x529B;&#xFF0C;&#x53C8;&#x8981;&#x591A;&#x5C11;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x7531;&#x4E8E;&#x9891;&#x7E41;&#x5730;&#x4E0E;&#x7F51;&#x9875;&#x4EE3;&#x7801;&#x63A5;&#x89E6;&#xFF0C;&#x6211;&#x8FC5;&#x901F;&#x638C;&#x63E1;&#x4E86;&#x5F53;&#x65F6;&#x4E3B;&#x6D41;&#x7684;&#x7F51;&#x9875;&#x524D;&#x540E;&#x7AEF;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x51B3;&#x5B9A;&#x8F6C;&#x5165;&#x7F51;&#x9875;&#x7F16;&#x7A0B;&#x9886;&#x57DF;&#x3002;&#x8FD9;&#x671F;&#x95F4;&#x6211;&#x8FD8;&#x5229;&#x7528;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5B66;&#x5B8C;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x8F6F;&#x4EF6;&#x672C;&#x79D1;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5730;&#x5B66;&#x4E60;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x539F;&#x7406;&#x3001;C/C++/Java&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4EE5;&#x53CA;&#x57FA;&#x7840;&#x7684;&#x7B97;&#x6CD5;&#x3001;&#x7F16;&#x8BD1;&#x539F;&#x7406;&#x3001;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x7B49;&#x8BFE;&#x7A0B;&#x3002;</p>
<p>2009&#x5E74;&#x6211;&#x6210;&#x7ACB;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#x5BA4;dminorstudio&#xFF0C;&#x540E;&#x8054;&#x5408;&#x521B;&#x7ACB;&#x4E0A;&#x6D77;&#x604B;&#x8DA3;&#x4FE1;&#x606F;&#x79D1;&#x6280;&#x6709;&#x9650;&#x516C;&#x53F8;&#xFF0C;&#x5E76;&#x6CBF;&#x7528;<a target="_blank" rel="noopener" href="https://dminorstudio.com/" title="external" target>dminorstudio</a>&#x4F5C;&#x4E3A;&#x54C1;&#x724C;&#x540D;&#x79F0;&#x3002;&#x6211;&#x4F5C;&#x4E3A;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#xFF0C;&#x62C5;&#x4EFB;dminorstudio&#x7684;&#x6280;&#x672F;&#x603B;&#x76D1;&#x81F3;&#x4ECA;&#x3002;</p>
<p>2010&#x5E74;&#x524D;&#x540E;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x63A5;&#x89E6;PHP&#x5F00;&#x6E90;&#x9879;&#x76EE;<a target="_blank" rel="noopener" href="https://www.drupal.org/" title="external" target>Drupal</a>&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x3002;&#x76F4;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;Drupal&#x4ECD;&#x7136;&#x662F;&#x6211;&#x548C;&#x6211;&#x7684;&#x56E2;&#x961F;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F7F;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<h3 id="&#x6211;&#x7684;&#x751F;&#x6D3B;"><a href="#&#x6211;&#x7684;&#x751F;&#x6D3B;" class="headerlink" title="&#x6211;&#x7684;&#x751F;&#x6D3B;"></a>&#x6211;&#x7684;&#x751F;&#x6D3B;</h3><p>&#x6211;&#x7684;&#x611F;&#x60C5;&#x7ECF;&#x5386;&#x975E;&#x5E38;&#x574E;&#x5777;&#xFF0C;&#x6709;&#x8FC7;&#x4E00;&#x6B21;&#x5931;&#x8D25;&#x7684;&#x5A5A;&#x59FB;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x5728;&#x51E0;&#x5E74;&#x671F;&#x95F4;&#x9677;&#x5165;&#x4E86;&#x4E25;&#x91CD;&#x7684;&#x5FC3;&#x7406;&#x5371;&#x673A;&#xFF0C;&#x6570;&#x75BE;&#x5E76;&#x53D1;&#xFF0C;&#x4E00;&#x5EA6;&#x6076;&#x5316;&#x5230;&#x5F71;&#x54CD;&#x6B63;&#x5E38;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x7684;&#x7A0B;&#x5EA6;&#x3002;2016&#x5E74;&#x6211;&#x5F00;&#x59CB;&#x7528;&#x51FA;&#x56FD;&#x65C5;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x7597;&#x6108;&#xFF0C;&#x53D6;&#x5F97;&#x4E86;&#x4E0D;&#x9519;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>2018&#x5E74;&#x6211;&#x628A;&#x6211;&#x4F4D;&#x4E8E;<a target="_blank" rel="noopener" href="https://iphx.meituan.com/share/housing/1202214?product_id=1202214&amp;share_source=product&amp;phx_wake_up_type=app_share&amp;phx_wake_up_source=qzone_detailpage&amp;cpwn=145356964&amp;utm_source=appshare&amp;utm_fromapp=" title="external" target>&#x4E0A;&#x6D77;&#x5E02;&#x6768;&#x6D66;&#x533A;&#x4F4F;&#x5904;&#x7684;&#x4E00;&#x95F4;&#x5367;&#x5BA4;</a>&#x6539;&#x9020;&#x6210;&#x6C11;&#x5BBF;&#xFF0C;&#x5F00;&#x59CB;&#x63A5;&#x5F85;&#x56DB;&#x65B9;&#x5BBE;&#x5BA2;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x81F3;&#x4ECA;&#x4ECD;&#x5728;&#x7EE7;&#x7EED;&#x3002;</p>
<h3 id="&#x6211;&#x4E0E;&#x97F3;&#x4E50;"><a href="#&#x6211;&#x4E0E;&#x97F3;&#x4E50;" class="headerlink" title="&#x6211;&#x4E0E;&#x97F3;&#x4E50;"></a>&#x6211;&#x4E0E;&#x97F3;&#x4E50;</h3><p>&#x6211;&#x5BF9;&#x4E50;&#x5668;&#x6709;&#x7740;&#x4E00;&#x79CD;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x8FF7;&#x604B;&#xFF0C;&#x5728;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x66FE;&#x62DC;&#x4E00;&#x4F4D;&#x97F3;&#x4E50;&#x7CFB;&#x7684;&#x6821;&#x53CB;&#x4E3A;&#x5E08;&#x5B66;&#x4E60;&#x5C0F;&#x63D0;&#x7434;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4E0E;&#x897F;&#x65B9;&#x53E4;&#x5178;&#x97F3;&#x4E50;&#x7ED3;&#x4E0B;&#x4E0D;&#x89E3;&#x4E4B;&#x7F18;&#x3002;2008&#x5E74;&#x52A0;&#x5165;&#x201C;&#x65AB;&#x7389;&#x63D0;&#x7434;&#x6C99;&#x9F99;&#x201D;&#xFF0C;&#x56E0;&#x6B64;&#x7ED3;&#x8BC6;&#x4E86;&#x4E00;&#x6279;&#x70ED;&#x7231;&#x97F3;&#x4E50;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x5E76;&#x5148;&#x540E;&#x5728;&#x4E0A;&#x6D77;&#x201C;&#x5764;&#x201D;&#x5BA4;&#x5185;&#x4E50;&#x56E2;&#x62C5;&#x4EFB;&#x5C0F;&#x63D0;&#x7434;&#x624B;&#x548C;&#x4E2D;&#x63D0;&#x7434;&#x624B;&#xFF0C;&#x5982;&#x4ECA;&#x5728;&#x4E0A;&#x6D77;&#x201C;&#x9646;&#x5BB6;&#x5634;&#x91D1;&#x878D;&#x57CE;&#x201D;&#x7BA1;&#x5F26;&#x4E50;&#x56E2;&#x62C5;&#x4EFB;&#x4E2D;&#x63D0;&#x7434;&#x9996;&#x5E2D;&#x3002;</p>
<p>&#x97F3;&#x4E50;&#x662F;&#x4E00;&#x76CF;&#x706F;&#xFF0C;&#x80FD;&#x7167;&#x4EAE;&#x5FC3;&#x7075;&#x6700;&#x9ED1;&#x6697;&#x7684;&#x89D2;&#x843D;&#x3002;</p>
<h3 id="&#x5173;&#x4E8E;&#x540D;&#x5B57;"><a href="#&#x5173;&#x4E8E;&#x540D;&#x5B57;" class="headerlink" title="&#x5173;&#x4E8E;&#x540D;&#x5B57;"></a>&#x5173;&#x4E8E;&#x540D;&#x5B57;</h3><p>&#x6211;&#x5728;&#x6700;&#x8BE5;&#x597D;&#x597D;&#x5B66;&#x4E60;&#x7684;&#x5E74;&#x9F84;&#x9009;&#x62E9;&#x4E86;&#x7F8E;&#x672F;&#xFF0C;&#x53C8;&#x5728;&#x5B66;&#x7F8E;&#x672F;&#x671F;&#x95F4;&#x53BB;&#x5B66;&#x4E86;&#x5C0F;&#x63D0;&#x7434;&#xFF0C;&#x6700;&#x540E;&#x4ECE;&#x4E8B;&#x7684;&#x5374;&#x662F;&#x7F51;&#x9875;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x786E;&#x5B9E;&#x633A;&#x80FD;&#x201C;&#x80E1;&#x95F9;&#x201D;&#x7684;&#x3002;&#x6211;&#x7ED9;&#x535A;&#x5BA2;&#x53D6;&#x540D;&#x201C;&#x53EA;&#x662F;&#x80E1;&#x95F9;&#x201D;&#xFF0C;&#x4EA6;&#x6709;&#x81EA;&#x6211;&#x97AD;&#x7B56;&#x548C;&#x8B66;&#x9192;&#x4E4B;&#x610F;&#x3002;&#x4E0D;&#x8FC7;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x201C;&#x80E1;&#x95F9;&#x201D;&#x5176;&#x5B9E;&#x662F;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x540D;&#xFF0C;&#x800C;&#x201C;&#x80E1;&#x828D;&#x201D;&#x5219;&#x662F;&#x6211;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x5411;&#x6821;&#x520A;&#x6295;&#x7A3F;&#x65F6;&#x6240;&#x7528;&#x7684;&#x7B14;&#x540D;&#x3002;</p>
<h3 id="&#x4E0E;&#x6211;&#x8054;&#x7CFB;"><a href="#&#x4E0E;&#x6211;&#x8054;&#x7CFB;" class="headerlink" title="&#x4E0E;&#x6211;&#x8054;&#x7CFB;"></a>&#x4E0E;&#x6211;&#x8054;&#x7CFB;</h3><p>&#x5DE5;&#x4F5C;&#x90AE;&#x7BB1;&#xFF1A;<a href="mailto:dan@dminorstudio.com">dan@dminorstudio.com</a><br>&#x4E2A;&#x4EBA;&#x90AE;&#x7BB1;&#xFF1A;<a href="mailto:hu1980@gmail.com">hu1980@gmail.com</a><br>&#x4E2A;&#x4EBA;QQ&#xFF1A;42200377</p>
</body></html>
    
    </div>
    
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 胡芍&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    
<script src="/js/jquery.js"></script>


<script src="/js/moment-with-locales.js"></script>


<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>

<script src="/js/outdatedbrowser.js"></script>

<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>




<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>