{"pages":[{"title":"关于","text":"四十岁是一个崭新的开始。 松浦弥太郎 四十岁的我，即将步入生命的第四十一个年头。 古云四十不惑，四十岁还依旧迷茫的人生是不及格的。回望我的过去四十年，确实有太多需要忏悔：一身痼疾，好逸恶劳，以致于时至今日仍旧居无定所，无事业以就功名，无伴侣以慰身心，更无子嗣以享天伦，所谓三无中年是也。如此说来，我竟没有什么是值得记下的了。 庆幸的是我仍旧有一颗渴望探究世界的孩童之心、对生活的热爱以及和对未来的期许，而我所需要的，或许只是更多一些的行动力。 我的一位好友在他四十岁生日之际，隐居三日，以求面壁思过，吐故纳新。我敬仰他的做法，却不必效仿。我是享乐主义者，深信只有奖励才能带来积极的效果。正如一个精美的笔记本或许就能激发一个人写作的欲望，我开通这个博客，作为送给自己的四十岁生日礼物。 关于我做自我介绍是一件困难的事情（当然，这只是一句冠冕堂皇的说词，实际情况是，当事人往往有许多难言之隐不足为外人道。）我想说的是我的几段重要的经历，也许这能部分地解释为何这里的内容会如此鱼龙混杂的原因。 少年时的我学习并不算太差，高中以前甚至可以用名列前茅来形容，然而我在初中和高中却分别有过一次逃学经历。经过一番曲折，我最终考入一所普通的艺术院校美术系学习中国画专业。 毕业后我开始从事网页设计工作（俗称“美工”）。这份工作本身带有一些“跨界”的性质，从业者既要有艺术设计能力，又要多少了解一些代码层面的知识。由于频繁地与网页代码接触，我迅速掌握了当时主流的网页前后端技术，并最终决定转入网页编程领域。这期间我还利用业余时间学完了计算机软件本科的课程，系统地学习了计算机原理、C/C++/Java编程语言以及基础的算法、编译原理、网络原理等课程。 2009年我成立个人工作室dminorstudio，后联合创立上海恋趣信息科技有限公司，并沿用dminorstudio作为品牌名称。我作为联合创始人之一，担任dminorstudio的技术总监至今。 2010年前后，我开始接触PHP开源项目Drupal，并把它用于工作当中。直至今日，Drupal仍然是我和我的团队日常工作中使用得最多的技术。 我的生活我的感情经历非常坎坷，有过一次失败的婚姻，这让我在几年期间陷入了严重的心理危机，数疾并发，一度恶化到影响正常的工作和生活的程度。2016年我开始用出国旅行的方式进行自我疗愈，取得了不错的效果。 2018年我把我位于上海市杨浦区住处的一间卧室改造成民宿，开始接待四方宾客，这个工作至今仍在继续。 我与音乐我对乐器有着一种与生俱来的迷恋，在大学期间曾拜一位音乐系的校友为师学习小提琴，这让我与西方古典音乐结下不解之缘。2008年加入“斫玉提琴沙龙”，因此结识了一批热爱音乐的小伙伴，并先后在上海“坤”室内乐团担任小提琴手和中提琴手，如今在上海“陆家嘴金融城”管弦乐团担任中提琴首席。 音乐是一盏灯，能照亮心灵最黑暗的角落。 关于名字我在最该好好学习的年龄选择了美术，又在学美术期间去学了小提琴，最后从事的却是网页编程方面的工作，确实挺能“胡闹”的。我给博客取名“只是胡闹”，亦有自我鞭策和警醒之意。不过很少有人知道的是，“胡闹”其实是我的一个小名，而“胡芍”则是我大学期间向校刊投稿时所用的笔名。 与我联系工作邮箱：dan@dminorstudio.com个人邮箱：hu1980@gmail.com个人QQ：42200377","link":"/about"}],"posts":[{"title":"宿民记","text":"本文最早发布于2018年11月2日的同名微信公众号上。 我家有间常年闲置的客房。看到这些年网上民宿生意方兴未艾，我心想何不把它好好布置一下做成民宿挂到网上？一来可以接待四方宾朋，二来还能顺便赚点零花钱，真是两全其美！ 理想很丰满，现实很骨感。 首先，要在民宿平台上挂出一套房源的繁琐步骤就多次让我望而却步，光是写出既诱人、又不夸大其词的介绍这一条就足够把我逼疯了。我的家，除去我主观上给它赋予的些许文艺气息之外，客观上实在是乏善可陈。我是一个追求极简生活作风的人，家里除了干净、整洁，每件物品都不可或缺之外，就真的找不出更多的优点了。而且周边没有什么高大上的商业和景点，到最近的地铁要十多分钟，唯一可以吹嘘的是这里真的有家不错的医院。 我的强迫症决定了只要是我想做的事情总有办法做到。写介绍，考验的不仅仅是我的文字功力，更像是在考验我在陈述事实和粉饰太平之间寻找平衡的能力；添置民宿的必需品，让我一次次在算经济账，要把每晚价格定到多少，才能在多长时间内把这些东西的价值赚回来；最后拍照片，还差点让我跌进了摄影发烧友的坑里。 我的第一笔订单是在所有这些工作完成之后的一个午后当我正准备享受一杯解乏的咖啡的时候。客人是个文质彬彬的小伙子，各方面都无可挑剔。第二天早上我们一起吃了早餐，我拿出笔和一叠彩色的便签纸，请他为我写下了第一条评语。短短的几十个字，洋溢着各种真诚的赞扬话语。这次小小的开门红极大地鼓舞了我想把这件事情继续做下去的信心。 后面的故事就太多太多了：有厌倦了在香港常年住酒店而一遇出差就偏爱找家庭民宿的金融届精英，也有日本学成回国在母亲的陪同下来上海找工作的漫画少女，有毕业后各奔东西而思念重聚的闺蜜，也有因为各种原因要出来享受一夜春宵的情侣……我有心记下与他们每一位的经历，只怕读者没有耐心继续读完这篇文章。好在让我欣慰的是，这些来去匆匆的客人虽然都不尽完美，却各有各的可爱之处，给我留下的除了房费，还有近百条清一色的好评。每次当我看着家里那面日渐变得色彩斑斓的留言墙时，心中总有一种说不出的满足感。 我很少接待长住的客人，最长不超过一周，这是我给我的网上房源设定的入住规则。但也有例外，其间就曾有过一位社会学女博士，因为学业原因需要经常出没于附近高校的图书馆。当时我倒是很想留她常住的，可惜她在我声情并茂地演示完我家的种种温馨舒适之后，最终选择了另一处住所，理由是她去学校可以节省五分钟的路程。之后也有很多咨询想要长住的客人，都被我一并回绝了——我很清楚地知道，我想要找的是客人，而不是室友，这两者的区别显而易见。 上个月我正好需要出国半个月，可巧的是，正好这时有位客人咨询是否可以长住，因为他们的家最近在装修，时间大约为20天，而这段时间正好是我在国外的时候。他们期望的入住时间是在我出国之前，而退房时间是在我回国之后，完美地填补了我民宿的空档。正式交易前我们进行了短暂的会面，以确定双方都是可靠的人。 是一对新婚夫妇，女孩个子不高，还有点驼背，留一头刘胡兰似的发型，能言会道，一说话就露出满嘴的牙套。男孩倒是高大帅气，只是有些腼腆，自始至终都很少说话。 “你会介意我们带两只猫一起来住吗？”女孩问。 “这个……”我面露难色。“可能有点介意哦。我很喜欢宠物，尤其是猫，但我本人完全没有养猫的经验，而且我家这么多花草、布艺和小摆设，也不太适合养猫的。” “哦，这个你可以放心，猫会关在笼子里，我们不会放它们出来的。” “好吧……”答应完他们之后我开始极其心疼起那两只可怜的猫来。 他们在当天晚上住进了我家。 第二天上午我又见到了那女孩，她很热情地跟我打招呼，我也跟她攀谈起来。据她说她是做金融行业的，是个大忙人，平时到处出差，很少在家；她老公也是上班族，每天早出晚归。我心里暗自欢喜。最后我提到了他们的猫，她立即停止话题，以飞一般的速度转身进屋去抱了一只出来。出现在我眼前的是一只毛色黑白相间的小花猫，乖乖地蜷缩在主人怀里，干净又可怜。 “猫平时会在笼子里，不会出来的，它们可乖可乖了。你看，我现在就把它们抱回去。”说着她又转身进了自己的房间。 我的航班是第三天的中午，临走前我把客厅阳台厨房卫生间所有公共空间都再次打扫了一遍，开始发现到处都有猫毛和猫脚印，甚至还有稀稀拉拉的猫砂，最让我心疼的是，我的一盆植物整个从架子上翻了下来，地上都是土。我开始懊恼起来。但是我马上就要去机场了，没时间跟他们理论，而且接下来的半个月我整个的家就都要交给他们了。这么一想，我又忍住了怒气，只是给她发送了一条留言： “亲，我今天就要走了，接下来的半个月我的家就麻烦你们多多照看了。你们的猫，如果一定要出来活动的话，记得要照看好，不要让它们抓东西哦。那些植物，它们对我的意义，和你的猫对你的意义是一样的，希望你能理解，务请多多照看，谢谢啦！” “好的。”回复只有短短的两个字。 我有些不安地上了飞机。 在国外期间，家住合肥的好友正好要去上海看歌星玛丽亚凯莉的演唱会，问是否可以住我家民宿。 “民宿有客人了，”我说，“不过你倒是可以住我的房间，我不在家。” 好友满心欢喜。 “你去了，正好可以帮我看看家，浇浇花扫扫地什么的，也不知道我家那两位客人把家里弄成什么样了。”我说，“对了，他们还有两只猫。” “只是……”好友踟蹰道，“我一个女的，他们两个人，怕不是什么坏人吧？” 我无心欣赏眼前新英格兰的秋景，义正严辞地说：“你这次是代表我出现在我的家里的，你是主人，他们是客人，你没有理由怕他们，应该是他们怕你才对！” 我把我有朋友要来家中入住这件事提前告诉了我的客人。 第二天，好友通过越洋视频向我远程展示了家中情景，并悉心帮我收拾停当。我略放心。 “只是那个女的一直都在房间里，所以我也不方便查看客房里的情况。”好友补充道。 回国时间终于到了，虽然进家门的那一刻我就已经做好了最坏的心理准备，但眼前景象依然勾起我的怒火。被猫爪挠过的绿萝叶子已经枯死发黑了，缩微小提琴纪念品整个翻过来，琴弓不翼而飞，枯山水上的水纹已经面目全非，白色的沙子泼洒出来，柜子地板上到处都是。其他的卫生问题我就不提了——我可以忍受一个不爱干净的人，但我不能忍受一个不能兑现承诺，而且犯错后无丝毫道歉行为和愧疚之心的人。 第二天我早早地起来收拾房间。如好友视频中所言，男孩已经上班去了，女孩还在房间里。——我终于知道了这个传说中的大忙人，实际上几乎每天24小时都在家。 大约十点左右她出来洗漱，我主动跟她打了个招呼，问她有没有时间聊一聊。她洗了个很长时间的澡，最后穿着浴袍湿着她刘胡兰一般的头发两手叉腰地出现在我的门口。 “我马上就要出去了，你要聊什么？” “就聊聊你们是否还要续住的问题，两天以后，也就是你们的退房日开始，已经连续三天都有其他客人预订了。” “我们还想继续住。”她说，接着跟我说了一大堆她家装修的进展，装修队如何如何拖延，中介平台如何如何推卸责任等等之类。我无暇听她啰嗦，说：“那后面的客人都已经预订了，你们必须得搬走。” “我们可以请他取消。”她理直气壮地说，“如果你不方便来做这件事，可以把电话给我，我来跟他说。” “可他们是三位不同的客人。”我说，“你能说服一位，你能同时说服三位都取消吗？” “啊？三位？”她诧异了一下，接着又恢复了面不改色的表情，“我可以，请把他们的电话都给我吧。” 我把客人的电话都给了她，一心以为她根本不可能做到这件事。 她坐到沙发上，开始锲而不舍地逐个劝说那三位客人取消我家民宿的预订。电话里她描述了我房源的诸多缺点，如交通不便，去往很多地方都很远，还有合住不能保障隐私之类。我开始听不下去了。 “你不能这么说！”我打断了她的电话。“你要说实情！要请他们取消的人是你，而不是我，而且你电话里描述的我房源的很多缺点并不属实。” 她没有理会，不打电话了，改作发短信。 当她成功地劝说完两位客人取消订单时，我开始有些坐不住了。我通过平台私信告诉了第三位入住客人我的电话，并告诉他，除此之外诱导他取消的电话都不要理会，那不是我。 第三位客人心领神会。 “那她是怎么知道我的电话号码的呢？”第三位客人问。 我哑口无言。我突然意识到我是做了一件多么大的错事，而且是一错再错！正因为我一次又一次地失守自己的原则，才导致今日之局面。 我打电话给远在纽约的朋友诉说我的苦闷，懊悔不已。 “她这是在不断地试探你的底线。”朋友说。 “难道这个世界上的人就都这么坏吗？”我沮丧地说，“我每让一步，她必进两步。” “不会啊，你之前招待了那么多客人，他们不都很好吗？” “是啊，”我说，“她早就已经把她的坏呈现出来了，从最开始的带猫入住，放猫出来，到强行要求续住，以及最后不择手段地劝退我的后续客人，她的所做所为早就已经多次触犯了我的底线，只是我一直选择视而不见，得过且过。” “我知道怎么做了，明天一早我就给他们下最后通牒，请他们走。”我说。 “必要的时候可以报警。”朋友提醒了一句。 半夜里我醒了，不知道是因为时差，还是因为在梦里已经想好了对策，迫不及待地要醒过来。我给一位好朋友发去信息：“我回国了，你明天有空来我家坐坐吗？给你带了华盛顿州的特产。” 第二天，朋友如期而至。人高马大的他，是专门在一家出租车公司处理事故纠纷的。我们什么都没做，只是在客厅里一边喝着从西雅图带回来的咖啡，一边吃着水果和点心，称兄道弟，谈笑风生。我的那位男客人早已上班去了，但我知道，女客人自始至终都在房间里，我们的对话她听得一清二楚。 又过了一天，两位客人和他们的猫终于悄无声息地从我的家中消失了。 我再次收拾好房间，准备迎接下一位客人。","link":"/2020/08/24/su-min-ji/"},{"title":"禅与摩托车维修艺术","text":"过去两个月，我一直在读这本400页的书。 这是我今年读过的最有价值的好书之一。 它很独特，一半是游记，讲述作者与儿子的一次摩托车旅行，从明尼苏达州一直到加州，耗时17天；另一半是哲学讨论，作者剖析自己的思想，寻求心灵的答案。两种文体交织在一起，维基百科称它为”哲学小说”。 作者波西格（1928-，Robert M. Pirsig）大学时主修生物化学，后来对哲学产生兴趣，1950年前往印度学习东方哲学。回国后，在当地大学担任写作课教师。1961年，他被诊断为偏执型精神分裂症和临床忧郁症，被多次送进精神病院，接受过28次电击疗法。 1968年出院后，他带着10岁的儿子克里斯，进行了一次长途摩托车旅行。他把旅行的感受和思考，写成了一本书《禅与摩托车维修艺术》（Zen and the Art of Motorcycle Maintenance）。 由于连续被121家出版社拒绝，直到1974年，这本书才出版。但是出版后，销售量惊人，超过500万册，成为70年代美国十大畅销书之一，目前累计销售量已经超过1000万册。《吉尼斯世界纪录》称它是”世界上被拒稿次数最多的畅销书”。 此书在国内有两个中文版：《父子的世界》（中国友谊出版公司，黄欣译，1999）和《万里任禅游》（重庆出版社，张国辰译，2006）。后面一个版本，今年9月已经再版了，并且终于将书名改成原名了。网上有这个版本的下载，翻译得相当不错。 阮一峰《禅与摩托车维修艺术》读后感","link":"/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/"},{"title":"如何像程序员一样写作","text":"请原谅我的标题党，抑或你可以把它理解为我拙劣的幽默感。如果Hexo有一个方便的功能可以标记一篇技术文章的难易程度，我一定会给本篇加上“技术小白”的标签以免贻笑大方。尽管如此，本文还是不免会落入“新手不懂，高手无用”的尴尬境地，就只当作是单纯地为了记录下我开通这个博客的过程吧，仅此而已。 言归正传，首先要回答的问题是：究竟怎样才算是“像程序员一样”？我相信每个程序员心里面都有自己认为最正确的答案。在我看来，像程序员一样，未必就是全程看不到图形界面，只会一顿操作猛如虎地狂敲各种代码和命令。WordPress的官网上有一句保留至今的经典脚注： CODE IS POETRY 翻译成中文我一样喜欢： 代码如诗 这句话完美地诠释了编程的一大特点（后面我会说到另一特点）——优雅地解决问题。诗的语言是最精炼的，好的代码亦应如此。 何为优雅？在我看来，无非就是举重若轻，游刃有余，用三五分的气力就能解决十分的问题，所谓事半功倍是也。当然优雅不是人人都能做到的，简单的两个字背后隐藏的其实是平时深厚的积累，甚至是很多人（包括我在内）不惜用一生去追求的目标。 举个极其简单的例子，假如我们需要计算一个数经过N次二倍增长后的结果，比如：56经过若干次二倍增长后依次为：118, 236, 472… 以此类推。最直观的思路是这样做： Javascript12345678function twice(a, n) { for (var i = 0; i &lt; n; i++) { a *= 2; } return a;}console.log(twice(56, 10)); 这样我们就可以得出56在经过10次二倍增长过后的值：57344。学过算法的同学应该一眼就能看出这个算法的效率是O(n)，即代码的执行时间会随着n的增加呈线性增长，因为它使用了一个单层循环。 实际上，如果你对所用的编程语言（这里是Javascript）足够了解，你就会知道它们都有一个执行幂运算的方法。Javascript中是用Math对象的pow()方法，因此以上运算便变成了求一个数与2的N次幂的乘积，直接用一个表达式就可以写出结果： Javascript1console.log(56 * Math.pow(2, 10)); 我们相信Javascript的幂运算是经过精心设计的，有着常数级的效率，因此这个算法的效率是O(1)。 最后，如果你了解位运算，并且限定被操作数是正整数的话，这个操作其实就是把被操作数按二进制位向左移N位（在不考虑溢出的情况下），因此可以写成： Javascript1console.log(56 &lt;&lt; 10); 这个算法的效率依然是O(1)，但排除通用性的弊端，移位运算的效率显然比函数调用要高得多。 以上例子演示了一段代码如何逐渐地向优雅方向发展，在书写效率提高的同时，执行效率也在提高（这两者并不总是成正比，但大部分情况下是如此），同时也表明优雅的背后其实是综合运用各种知识的能力（如这里的幂运算和二进制移位等）。 好的代码的另一个特点是良好的逻辑性和自我解释性。 让代码自己说话 Venkat Subramaniam / Andy Hunt高效程序员的45个习惯 如果你总是为自己的代码书写海量的注释最后却还是让人一头雾水的话，你该做的不是去提升文笔，而是应该好好修炼一下编码的能力。好的代码自己会说话，这包括完美的逻辑结构和命名等。程序员的思路应该和惯常的逻辑思维模式高度契合，所谓“清奇的脑回路”往往不但不解决问题，还会扰乱他人的思考节奏。试想你停留在一个问题的某个节点上，它的下一个节点应该是自然而然地显露出来，而并不需要十分费力地去揣摩。在面向对象编程中，对象的设计应该像能引起观众共鸣的艺术品一样，即使不能一看就懂，也可以做到让人由衷感叹“这正是我所想的”。 综上所述，我觉得程序员是最适合写作的职业之一，因为写作和编程，二者何其相辅相成？！坚持写作可以让你的代码更加优雅；而把处理编程问题的思维应用到写作上，又可以让你写出的文章更具有条理性，逻辑更加严谨，更加简明易懂；最后，为了能驾轻就熟地阐述你的观点，你必然要注重平时的知识积累，用三五分的气力就能解释清楚十分的问题。 工具的选择大部分程序员都痴迷于工具，这不难理解。——编程本质上就是一项把重复任务自动化和机械化的工作，这和工具诞生的初衷如出一辙。这里所说的工具是广义上的，不单指看得见摸得着的硬件和软件，还有技术和方法，比如编程语言，以及平台、框架和理论体系等等。 虽说“工欲善其事，必先利其器”，然而沉迷于工具则会过犹不及。使用何种工具永远只取决于任务本身，而不是工具本身，当你还在纠结使用何种工具时，有的人可能早就已经将任务完成了。换句话说，一件工具或是一种方法之所以迷人，应该缘自它能高效地解决问题，而不应该是任何其他原因。有的时候解决一个问题的过程并不那么炫酷，但只要管用，你就应该那么去做。明智的人办事永远都是不拘一格的。 界面困境界面是不是总是必须的呢？答案是否定的。或者说界面并不是越多越强大就越好，好的界面是量入为出的，够用的就是最好的。 制作界面的成本很高，而效率则往往低得惊人。用图形界面管理过服务器的人一定有过这样的经历，要把一批文件从一台服务器传送到另一台服务器，如果使用界面的话，步骤可谓繁琐，而如果直接在两台服务器之间建立通路，则用极少的步骤就可以实现文件的传输了。 好在程序员们并不像热衷工具那么热衷于界面，——他们会制作繁复而精美的界面给他们的用户去使用，但心里都清楚，要搞定事情还是不用界面来得快。 回到写作上，再强大的写作工具，也无外乎解决以下问题：结构（提纲、章节等），内容（文字、图形图像、声音、视频等），引用（与相关内容之间的连接），格式（字体、字号、颜色、记号等），发表和获得反馈（让文章可以公开访问、分享、评论等）。能解决以上问题，这个写作工具便是合格的，而能用最高效便捷的方式去解决，这个工具就是优秀的了。 减少无谓的信息流动以上观点可以用四个字总结：能省则省。这个原则同样适用在其他方面，比如信息的流动。——如果读者眼前的内容并没有发生任何变化，则完全没有理由去重新加载它们。也许将来随着硬件技术的革命，信息流动的成本不会一直那么高，但那个时候信息量也会成倍增加，减少无谓的信息流动依然是具有现实意义的。一个现象是，现代浏览器接替了原来很多必须由服务器完成的工作，比如界面的交互，少量数据的存储等等，这实际上是在遵循减少信息流动这一原则。 把这一原则应用到写作上，你应该总是标明文章的最后更新日期，并且尽量显示出本次更新的部分，这样读者不必从头开始重新阅读你的文章就能把握新的信息。 最后回答标题中的那个问题：如何像程序员一样写作？ 首先，程序员的写作风格一定是精简并且逻辑严谨的，连篇累牍却言之无物的文章绝对是与程序员风格背道而驰的。其次，在工具的选择上，程序员更倾向于不拘一格，高效是唯一的选择标准。最后，为了实现作者和读者的效率最优化，程序员应该减少甚至杜绝无谓的信息流动。 马上就开始说了这么多，最后还是四个字：内容为王，还是要把精力放在内容的创作上。为此，我用大约十分钟的时间搭建好了这个博客工具，不使用界面，而只用最快捷的文本编辑器（如vi或emacs），因为有了Markdown作为格式化语言，即便这样也可以做到很直观地编辑，而且除非有更新，否则不会重复发布内容。这也是我为什么选择Hexo作为工具的原因。","link":"/2020/08/27/%E5%A6%82%E4%BD%95%E5%83%8F%E7%A8%8B%E5%BA%8F%E5%91%98%E4%B8%80%E6%A0%B7%E5%86%99%E4%BD%9C/"},{"title":"A4纸的尺寸和十二平均律","text":"前几天在我们乐团群聊里聊到音律问题，我聊兴颇足，还自以为是地发表了一番“高论”： 在已知基准音频率的前提下，利用下面的公式可以求十二平均律下任何一个音的频率： 目标音频率 = 基准音频率 ÷ 12 × 目标音和基准音之间的半音个数 遗憾的是，这个公式是错误的！ 以基准音为a1（频率440赫兹）为例，我用以上公式来计算其上方五度音e2的频率，得出的结果为：440 ÷ 12 × 7 = 696.666666…，这根本不是e2的频率，而是已经快接近f2的频率了。这里有个非常关键性的错误是：我想当然地误解了十二平均律中“平均”一词的概念。虽然我不是音乐科班出身，犯下这种错误情有可原，但我仍然为我的学艺不精又爱瞎表现而感到深深的惭愧。 读者如果还不知道这个问题的正确答案，不妨先思考一下，我将在本文的末尾揭晓。在此之前，我想先跟大家分享另一个有趣的话题，它来自我最近在读的一本书——《欢乐数学》（英文原名：Math with Bad Drawings）。 图片来源：https://mathwithbaddrawings.com/ 数学和烂插画这是这本书的英文原名（Math with Bad Drawings）的直译。（老实说，“烂插画”这个用语是作者的自谦，我个人认为画得还是挺不错的。） 该书用最浅显易懂的方式来介绍常见的数学知识。为此，作者不惜运用大量风趣幽默的比喻和让人忍俊不禁的漫画，并且把每一个要讲述的理论知识都贯穿在现实的例子当中，书中的数学似乎不再是抽象难懂的公式和定理，而是我们身边活生生的存在。 顺便说一下，该书的画风是这个样子的： 并且，作者还（意外地）是个年轻的帅哥呢： A4纸的尺寸问题在这里我想要引用的是该书第七章——合理的纸张尺寸——中的内容。作者是美国人，在英国工作期间非常不习惯使用A4纸办公，因为在美国，大家都习惯使用信纸（Letter），它的宽是8.5英寸，高是11英寸，而A4纸的宽和高则分别为210mm和297mm，（本文中我一致使用”高“和”宽“来分别指代矩形的长边和短边。）现在，你也许会理解作者的困惑了——相比后者，前面那个尺寸听上去舒服多了，不是吗？210×297，这是哪门子的尺寸？该不会是哪个疯子想出来的吧？ 然而事实是，A4是目前全世界使用最普遍的办公用纸，所以，这其中一定另有玄机。如果你对这个知识点了解更多的话，应该知道A4只是一系列纸张尺寸中的一个，从A0，A1，……一直到A5，编号越小，尺寸越大，而所有这些尺寸的高宽比都是一样的，并且更为神奇的是，任何两张相同尺寸的纸张并排放在一起就正好可以拼成一张比它大一号的纸张。这，就是A4纸的奥妙所在。 各种纸张尺寸之间的关系 那么这个高宽比究竟要定为多少，才能满足上述条件呢？ 好，数学开始派上用场了。 我们假设这个高宽比为q（后面你会看到，我在这里选择这个字母是有用意的），再任意选取一个纸张尺寸（比如A4），并令它的宽为1（你可以理解为1倍的210）。因为所有尺寸的高宽比都是q，可知A4纸的高是1 × q = q，或者说q倍的210，而这个数字又正好是比它大一号的A3纸的宽，进而可以推出，A3的高是：q × q = q2。重复这个步骤，我可以得到下面的一组数列： 1, q, q2, q3, … 如果大家还能回忆起中学以前学过的知识，应该记得这个数列我们把它叫作等比数列，而q就是这个等比数列的公比。现在你应该知道我为什么要使用q这个字母了，因为它是等比数列的公比这一概念的约定称谓。 只要求出q的值，我们的问题就解开了，别忘了这里还有一个没有使用的条件：两张小号纸张并排摆放正好可以拼出一张大号纸张，也就是说，大号纸张的高是小号纸张宽的两倍。从这个条件我们可以得出下面的等式： q2 = 2 不难看出，q的值正好就是那个神奇的无理数：√2，这就是我们要找的高宽比。它是唯一符合条件的解，也就是说，纸张尺寸要满足上述从大到小的变化规律，这个高宽比别无其它选择，只能是√2。现在，你还会觉得这个数字是凭空想像出来的吗？ “就这？”你会说，“也不过如此嘛！” 别急，以上只是一个铺垫，接下来才真正要进入到精彩的部分了。 “A4纸理论”的推广在上述纸张尺寸的例子当中我们可以看到，210这个数字经过2次和√2这个比值相乘，最后变成了自身的两倍。我们不妨将这里的数字（210，2，2，√2，420）都看作是可以变化的量，从而将这个概念推而广之：一个数字经过若干次的和另一个数字相乘，最后变成了一个我们所期望的数字。（细心的你会发现我把数字2列了两遍，是的，它们分别代表该例中的2次和2倍，意义不同。） 这样的例子很多，不胜枚举。比如我们耳熟能详的“国王与米粒”的故事，数学家让一粒米64次与2相乘，从而获得国王对他几辈子都吃不完的粮食的许诺；又或者某个老妇人在年轻时做的一笔1万元的投资，以平均20%的年增幅在50年后的今天变成了一笔可观的财富（大约是9000多万）。经济学家喜欢用这样的例子来告诉你”复利“的威力，成长规划师喜欢用这样的例子来激励你，每天进步一点点，一段时间后你就可以脱胎换骨了。 我们把上述例子中提到的各种量用表格列出来，如下： 初始值 变化次数 比值 预期倍数 预期值 纸张尺寸 210 2 √2 2 420 国王与米粒 1 64 2 18446744073709551616 18446744073709551616 老妇人的投资 1 50 1.2 9100.438150002134 9100.438150002134 我们把初始值都统一为1，这样就可以让预期倍数等同于预期值。通过简化，我们要考察的量是下面的三个： 变化次数(n)、比值(q)、预期值(a) 用公式写出来就是： qn = a 这三个量只要知道其中的任意两个，就可以求出第三个：已知q和n，求a，我们做乘方运算；已知n和a，求q，我们做开方运算；而已知q和a，求n，我们做对数运算。 我们把等比数列的各个项用坐标系上的点表示出来，横轴表示项次，纵轴表示该项的值，可以看出它们具有指数函数的性质，或者说它们就是某个指数函数曲线上的一组离散点。当公比q为正数时，它相当于指数函数的底（实际上公比q可以为负数，本文就不作讨论了）。 例子的坐标表示 十二平均律问题最后我们不得不回到本文一开头挖下的那个坑：十二平均律中各个音的频率究竟应该如何计算？ 这基于以下这样一个听觉事实：音乐中的一个音每升高八度（十二个半音），其频率是原来的2倍。 是不是有点耳熟呢？是的，这里又出现了“2倍”这个概念。还记得吗？A4纸变成A3纸，后者的高是前者的宽的2倍。不同的是，A4纸的宽只需要越过2个梯度（先变为A4的高，即√2倍宽，也就是A3的宽，再变成其2倍）就到了A3纸的高，而音乐中一个音到它的高八度音之间需要越过12个梯度！ 套用上面的qn = a公式，我们不难看出，这里我已知的是n和a（n=12，a=2），而要求的是底数q。这是一个开方运算，2的12次方根，借助计算工具，我们得知它的值非常接近于：1.059463094，音乐生应该都知道，这个数字就是十二平均律中任意两个相邻半音之间的频率之比。","link":"/2021/06/07/A4%E7%BA%B8%E7%9A%84%E5%A4%A7%E5%B0%8F%E5%92%8C%E5%8D%81%E4%BA%8C%E5%B9%B3%E5%9D%87%E5%BE%8B/"}],"tags":[{"name":"民宿","slug":"民宿","link":"/tags/%E6%B0%91%E5%AE%BF/"},{"name":"禅与摩托车维修艺术","slug":"禅与摩托车维修艺术","link":"/tags/%E7%A6%85%E4%B8%8E%E6%91%A9%E6%89%98%E8%BD%A6%E7%BB%B4%E4%BF%AE%E8%89%BA%E6%9C%AF/"},{"name":"Zen and the Art of Motorcycle Maintenance","slug":"Zen-and-the-Art-of-Motorcycle-Maintenance","link":"/tags/Zen-and-the-Art-of-Motorcycle-Maintenance/"},{"name":"趣味数学","slug":"趣味数学","link":"/tags/%E8%B6%A3%E5%91%B3%E6%95%B0%E5%AD%A6/"},{"name":"十二平均律","slug":"十二平均律","link":"/tags/%E5%8D%81%E4%BA%8C%E5%B9%B3%E5%9D%87%E5%BE%8B/"}],"categories":[{"name":"生活","slug":"life","link":"/categories/life/"},{"name":"读书","slug":"book","link":"/categories/book/"},{"name":"故事","slug":"story","link":"/categories/story/"},{"name":"探技","slug":"technology","link":"/categories/technology/"}]}