{"pages":[{"title":"关于","text":"四十岁是一个崭新的开始。 松浦弥太郎 四十岁的我，即将步入生命的第四十一个年头。 古云四十不惑，四十岁还依旧迷茫的人生是不及格的。回望我的过去四十年，确实有太多需要忏悔：一身痼疾，好逸恶劳，以致于时至今日仍旧居无定所，无事业以就功名，无伴侣以慰身心，更无子嗣以享天伦，所谓三无中年是也。如此说来，我竟没有什么是值得记下的了。 庆幸的是我仍旧有一颗渴望探究世界的孩童之心、对生活的热爱以及和对未来的期许，而我所需要的，或许只是更多一些的行动力。 我的一位好友在他四十岁生日之际，隐居三日，以求面壁思过，吐故纳新。我敬仰他的做法，却不必效仿。我是享乐主义者，深信只有奖励才能带来积极的效果。正如一个精美的笔记本或许就能激发一个人写作的欲望，我开通这个博客，作为送给自己的四十岁生日礼物。 关于我做自我介绍是一件困难的事情（当然，这只是一句冠冕堂皇的说词，实际情况是，当事人往往有许多难言之隐不足为外人道。）我想说的是我的几段重要的经历，也许这能部分地解释为何这里的内容会如此鱼龙混杂的原因。 少年时的我学习并不算太差，高中以前甚至可以用名列前茅来形容，然而我在初中和高中却分别有过一次逃学经历。经过一番曲折，我最终考入一所普通的艺术院校美术系学习中国画专业。 毕业后我开始从事网页设计工作（俗称“美工”）。这份工作本身带有一些“跨界”的性质，从业者既要有艺术设计能力，又要多少了解一些代码层面的知识。由于频繁地与网页代码接触，我迅速掌握了当时主流的网页前后端技术，并最终决定转入网页编程领域。这期间我还利用业余时间学完了计算机软件本科的课程，系统地学习了计算机原理、C/C++/Java编程语言以及基础的算法、编译原理、网络原理等课程。 2009年我成立个人工作室dminorstudio，后联合创立上海恋趣信息科技有限公司，并沿用dminorstudio作为品牌名称。我作为联合创始人之一，担任dminorstudio的技术总监至今。 2010年前后，我开始接触PHP开源项目Drupal，并把它用于工作当中。直至今日，Drupal仍然是我和我的团队日常工作中使用得最多的技术。 我的生活我的感情经历非常坎坷，有过一次失败的婚姻，这让我在几年期间陷入了严重的心理危机，数疾并发，一度恶化到影响正常的工作和生活的程度。2016年我开始用出国旅行的方式进行自我疗愈，取得了不错的效果。 2018年我把我位于上海市杨浦区住处的一间卧室改造成民宿，开始接待四方宾客，这个工作至今仍在继续。 我与音乐我对乐器有着一种与生俱来的迷恋，在大学期间曾拜一位音乐系的校友为师学习小提琴，这让我与西方古典音乐结下不解之缘。2008年加入“斫玉提琴沙龙”，因此结识了一批热爱音乐的小伙伴，并先后在上海“坤”室内乐团担任小提琴手和中提琴手，如今在上海“陆家嘴金融城”管弦乐团担任中提琴首席。 音乐是一盏灯，能照亮心灵最黑暗的角落。 关于名字我在最该好好学习的年龄选择了美术，又在学美术期间去学了小提琴，最后从事的却是网页编程方面的工作，确实挺能“胡闹”的。我给博客取名“只是胡闹”，亦有鞭策警醒之意。不过很少有人知道的是，“胡闹”其实是我的一个小名，而“胡芍”则是我大学期间向校刊投稿时所用的笔名。","link":"/about"}],"posts":[{"title":"宿民记","text":"按：本文最早发布于2018年11月2日的同名微信公众号上，系旧文重发。 我家有间常年闲置的客房。看到这些年网上民宿生意方兴未艾，我心想何不把它好好布置一下做成民宿挂到网上？一来可以接待四方宾朋，二来还能顺便赚点零花钱，真是两全其美！ 理想很丰满，现实很骨感。 首先，要在民宿平台上挂出一套房源的繁琐步骤就多次让我望而却步，光是写出既诱人、又不夸大其词的介绍这一条就足够把我逼疯了。我的家，除去我主观上给它赋予的些许文艺气息之外，客观上实在是乏善可陈。我是一个追求极简生活作风的人，家里除了干净、整洁，每件物品都不可或缺之外，就真的找不出更多的优点了。而且周边没有什么高大上的商业和景点，到最近的地铁要十多分钟，唯一可以吹嘘的是这里真的有家不错的医院。 我的强迫症决定了只要是我想做的事情总有办法做到。写介绍，考验的不仅仅是我的文字功力，更像是在考验我在陈述事实和粉饰太平之间寻找平衡的能力；添置民宿的必需品，让我一次次在算经济账，要把每晚价格定到多少，才能在多长时间内把这些东西的价值赚回来；最后拍照片，还差点让我跌进了摄影发烧友的坑里。 我的第一笔订单是在所有这些工作完成之后的一个午后当我正准备享受一杯解乏的咖啡的时候。客人是个文质彬彬的小伙子，各方面都无可挑剔。第二天早上我们一起吃了早餐，我拿出笔和一叠彩色的便签纸，请他为我写下了第一条评语。短短的几十个字，洋溢着各种真诚的赞扬话语。这次小小的开门红极大地鼓舞了我想把这件事情继续做下去的信心。 后面的故事就太多太多了：有厌倦了在香港常年住酒店而一遇出差就偏爱找家庭民宿的金融届精英，也有日本学成回国在母亲的陪同下来上海找工作的漫画少女，有毕业后各奔东西而思念重聚的闺蜜，也有因为各种原因要出来享受一夜春宵的情侣……我有心记下与他们每一位的经历，只怕读者没有耐心继续读完这篇文章。好在让我欣慰的是，这些来去匆匆的客人虽然都不尽完美，却各有各的可爱之处，给我留下的除了房费，还有近百条清一色的好评。每次当我看着家里那面日渐变得色彩斑斓的留言墙时，心中总有一种说不出的满足感。 我很少接待长住的客人，最长不超过一周，这是我给我的网上房源设定的入住规则。但也有例外，其间就曾有过一位社会学女博士，因为学业原因需要经常出没于附近高校的图书馆。当时我倒是很想留她常住的，可惜她在我声情并茂地演示完我家的种种温馨舒适之后，最终选择了另一处住所，理由是她去学校可以节省五分钟的路程。之后也有很多咨询想要长住的客人，都被我一并回绝了——我很清楚地知道，我想要找的是客人，而不是室友，这两者的区别显而易见。 上个月我正好需要出国半个月，可巧的是，正好这时有位客人咨询是否可以长住，因为他们的家最近在装修，时间大约为20天，而这段时间正好是我在国外的时候。他们期望的入住时间是在我出国之前，而退房时间是在我回国之后，完美地填补了我民宿的空档。正式交易前我们进行了短暂的会面，以确定双方都是可靠的人。 是一对新婚夫妇，女孩个子不高，还有点驼背，留一头刘胡兰似的发型，能言会道，一说话就露出满嘴的牙套。男孩倒是高大帅气，只是有些腼腆，自始至终都很少说话。 “你会介意我们带两只猫一起来住吗？”女孩问。 “这个……”我面露难色。“可能有点介意哦。我很喜欢宠物，尤其是猫，但我本人完全没有养猫的经验，而且我家这么多花草、布艺和小摆设，也不太适合养猫的。” “哦，这个你可以放心，猫会关在笼子里，我们不会放它们出来的。” “好吧……”答应完他们之后我开始极其心疼起那两只可怜的猫来。 他们在当天晚上住进了我家。 第二天上午我又见到了那女孩，她很热情地跟我打招呼，我也跟她攀谈起来。据她说她是做金融行业的，是个大忙人，平时到处出差，很少在家；她老公也是上班族，每天早出晚归。我心里暗自欢喜。最后我提到了他们的猫，她立即停止话题，以飞一般的速度转身进屋去抱了一只出来。出现在我眼前的是一只毛色黑白相间的小花猫，乖乖地蜷缩在主人怀里，干净又可怜。 “猫平时会在笼子里，不会出来的，它们可乖可乖了。你看，我现在就把它们抱回去。”说着她又转身进了自己的房间。 我的航班是第三天的中午，临走前我把客厅阳台厨房卫生间所有公共空间都再次打扫了一遍，开始发现到处都有猫毛和猫脚印，甚至还有稀稀拉拉的猫砂，最让我心疼的是，我的一盆植物整个从架子上翻了下来，地上都是土。我开始懊恼起来。但是我马上就要去机场了，没时间跟他们理论，而且接下来的半个月我整个的家就都要交给他们了。这么一想，我又忍住了怒气，只是给她发送了一条留言： “亲，我今天就要走了，接下来的半个月我的家就麻烦你们多多照看了。你们的猫，如果一定要出来活动的话，记得要照看好，不要让它们抓东西哦。那些植物，它们对我的意义，和你的猫对你的意义是一样的，希望你能理解，务请多多照看，谢谢啦！” “好的。”回复只有短短的两个字。 我有些不安地上了飞机。 在国外期间，家住合肥的好友正好要去上海看歌星玛丽亚凯莉的演唱会，问是否可以住我家民宿。 “民宿有客人了，”我说，“不过你倒是可以住我的房间，我不在家。” 好友满心欢喜。 “你去了，正好可以帮我看看家，浇浇花扫扫地什么的，也不知道我家那两位客人把家里弄成什么样了。”我说，“对了，他们还有两只猫。” “只是……”好友踟蹰道，“我一个女的，他们两个人，怕不是什么坏人吧？” 我无心欣赏眼前新英格兰的秋景，义正严辞地说：“你这次是代表我出现在我的家里的，你是主人，他们是客人，你没有理由怕他们，应该是他们怕你才对！” 我把我有朋友要来家中入住这件事提前告诉了我的客人。 第二天，好友通过越洋视频向我远程展示了家中情景，并悉心帮我收拾停当。我略放心。 “只是那个女的一直都在房间里，所以我也不方便查看客房里的情况。”好友补充道。 回国时间终于到了，虽然进家门的那一刻我就已经做好了最坏的心理准备，但眼前景象依然勾起我的怒火。被猫爪挠过的绿萝叶子已经枯死发黑了，缩微小提琴纪念品整个翻过来，琴弓不翼而飞，枯山水上的水纹已经面目全非，白色的沙子泼洒出来，柜子地板上到处都是。其他的卫生问题我就不提了——我可以忍受一个不爱干净的人，但我不能忍受一个不能兑现承诺，而且犯错后无丝毫道歉行为和愧疚之心的人。 第二天我早早地起来收拾房间。如好友视频中所言，男孩已经上班去了，女孩还在房间里。——我终于知道了这个传说中的大忙人，实际上几乎每天24小时都在家。 大约十点左右她出来洗漱，我主动跟她打了个招呼，问她有没有时间聊一聊。她洗了个很长时间的澡，最后穿着浴袍湿着她刘胡兰一般的头发两手叉腰地出现在我的门口。 “我马上就要出去了，你要聊什么？” “就聊聊你们是否还要续住的问题，两天以后，也就是你们的退房日开始，已经连续三天都有其他客人预订了。” “我们还想继续住。”她说，接着跟我说了一大堆她家装修的进展，装修队如何如何拖延，中介平台如何如何推卸责任等等之类。我无暇听她啰嗦，说：“那后面的客人都已经预订了，你们必须得搬走。” “我们可以请他取消。”她理直气壮地说，“如果你不方便来做这件事，可以把电话给我，我来跟他说。” “可他们是三位不同的客人。”我说，“你能说服一位，你能同时说服三位都取消吗？” “啊？三位？”她诧异了一下，接着又恢复了面不改色的表情，“我可以，请把他们的电话都给我吧。” 我把客人的电话都给了她，一心以为她根本不可能做到这件事。 她坐到沙发上，开始锲而不舍地逐个劝说那三位客人取消我家民宿的预订。电话里她描述了我房源的诸多缺点，如交通不便，去往很多地方都很远，还有合住不能保障隐私之类。我开始听不下去了。 “你不能这么说！”我打断了她的电话。“你要说实情！要请他们取消的人是你，而不是我，而且你电话里描述的我房源的很多缺点并不属实。” 她没有理会，不打电话了，改作发短信。 当她成功地劝说完两位客人取消订单时，我开始有些坐不住了。我通过平台私信告诉了第三位入住客人我的电话，并告诉他，除此之外诱导他取消的电话都不要理会，那不是我。 第三位客人心领神会。 “那她是怎么知道我的电话号码的呢？”第三位客人问。 我哑口无言。我突然意识到我是做了一件多么大的错事，而且是一错再错！正因为我一次又一次地失守自己的原则，才导致今日之局面。 我打电话给远在纽约的朋友诉说我的苦闷，懊悔不已。 “她这是在不断地试探你的底线。”朋友说。 “难道这个世界上的人就都这么坏吗？”我沮丧地说，“我每让一步，她必进两步。” “不会啊，你之前招待了那么多客人，他们不都很好吗？” “是啊，”我说，“她早就已经把她的坏呈现出来了，从最开始的带猫入住，放猫出来，到强行要求续住，以及最后不择手段地劝退我的后续客人，她的所做所为早就已经多次触犯了我的底线，只是我一直选择视而不见，得过且过。” “我知道怎么做了，明天一早我就给他们下最后通牒，请他们走。”我说。 “必要的时候可以报警。”朋友提醒了一句。 半夜里我醒了，不知道是因为时差，还是因为在梦里已经想好了对策，迫不及待地要醒过来。我给一位好朋友发去信息：“我回国了，你明天有空来我家坐坐吗？给你带了华盛顿州的特产。” 第二天，朋友如期而至。人高马大的他，是专门在一家出租车公司处理事故纠纷的。我们什么都没做，只是在客厅里一边喝着从西雅图带回来的咖啡，一边吃着水果和点心，称兄道弟，谈笑风生。我的那位男客人早已上班去了，但我知道，女客人自始至终都在房间里，我们的对话她听得一清二楚。 又过了一天，两位客人和他们的猫终于悄无声息地从我的家中消失了。 我再次收拾好房间，准备迎接下一位客人。","link":"/2020/08/24/su-min-ji/"},{"title":"禅与摩托车维修艺术","text":"过去两个月，我一直在读这本400页的书。 这是我今年读过的最有价值的好书之一。 它很独特，一半是游记，讲述作者与儿子的一次摩托车旅行，从明尼苏达州一直到加州，耗时17天；另一半是哲学讨论，作者剖析自己的思想，寻求心灵的答案。两种文体交织在一起，维基百科称它为”哲学小说”。 作者波西格（1928-，Robert M. Pirsig）大学时主修生物化学，后来对哲学产生兴趣，1950年前往印度学习东方哲学。回国后，在当地大学担任写作课教师。1961年，他被诊断为偏执型精神分裂症和临床忧郁症，被多次送进精神病院，接受过28次电击疗法。 1968年出院后，他带着10岁的儿子克里斯，进行了一次长途摩托车旅行。他把旅行的感受和思考，写成了一本书《禅与摩托车维修艺术》（Zen and the Art of Motorcycle Maintenance）。 由于连续被121家出版社拒绝，直到1974年，这本书才出版。但是出版后，销售量惊人，超过500万册，成为70年代美国十大畅销书之一，目前累计销售量已经超过1000万册。《吉尼斯世界纪录》称它是”世界上被拒稿次数最多的畅销书”。 此书在国内有两个中文版：《父子的世界》（中国友谊出版公司，黄欣译，1999）和《万里任禅游》（重庆出版社，张国辰译，2006）。后面一个版本，今年9月已经再版了，并且终于将书名改成原名了。网上有这个版本的下载，翻译得相当不错。 阮一峰《禅与摩托车维修艺术》读后感","link":"/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/"}],"tags":[{"name":"民宿","slug":"民宿","link":"/tags/%E6%B0%91%E5%AE%BF/"},{"name":"禅与摩托车维修艺术","slug":"禅与摩托车维修艺术","link":"/tags/%E7%A6%85%E4%B8%8E%E6%91%A9%E6%89%98%E8%BD%A6%E7%BB%B4%E4%BF%AE%E8%89%BA%E6%9C%AF/"},{"name":"Zen and the Art of Motorcycle Maintenance","slug":"Zen-and-the-Art-of-Motorcycle-Maintenance","link":"/tags/Zen-and-the-Art-of-Motorcycle-Maintenance/"}],"categories":[{"name":"生活","slug":"life","link":"/categories/life/"},{"name":"故事","slug":"story","link":"/categories/story/"},{"name":"读书","slug":"book","link":"/categories/book/"}]}