<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>只是胡闹</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">


<link rel="stylesheet" href="/css/outdatedbrowser.css">





<meta name="description" content="">







<link rel="alternative" href="/atom.xml" title="只是胡闹" type="application/atom+xml">




<!--<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">-->

<link rel="stylesheet" href="/css/bulma.css">




<link rel="stylesheet" href="/css/lightgallery.css">


<link rel="stylesheet" href="/css/justifiedGallery.css">




<link rel="stylesheet" href="/css/atom-one-light.css">



<link rel="stylesheet" href="/css/style.css">



<script src="/js/fontawesome-all.js"></script>




<meta name="generator" content="Hexo 5.0.2"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    <img src="/images/logo.png" alt="" height="28">
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/life">生活</a>
            
            <a class="navbar-item "
               href="/categories/book">读书</a>
            
            <a class="navbar-item "
               href="/categories/music">爱乐</a>
            
            <a class="navbar-item "
               href="/categories/art">品艺</a>
            
            <a class="navbar-item "
               href="/categories/movie">观影</a>
            
            <a class="navbar-item "
               href="/categories/technology">探技</a>
            
            <a class="navbar-item "
               href="/categories/story">故事</a>
            
            <a class="navbar-item "
               href="/archives">所有文章</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/ppoffice/hexo-theme-minos">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/27/%E5%83%8F%E7%A8%8B%E5%BA%8F%E5%91%98%E4%B8%80%E6%A0%B7%E5%86%99%E4%BD%9C/" itemprop="url">像程序员一样写作</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-26T16:23:29.000Z" itemprop="datePublished">8月 27 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/technology/">探技</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            8 分钟 读完 (约 1273 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x7684;&#x6807;&#x9898;&#x515A;&#xFF0C;&#x6291;&#x6216;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x6491;&#x6211;&#x62D9;&#x52A3;&#x7684;&#x5E7D;&#x9ED8;&#x611F;&#x3002;</p>
<p>&#x5982;&#x679C;Hexo&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x6807;&#x8BB0;&#x4E00;&#x7BC7;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x7ED9;&#x672C;&#x7BC7;&#x52A0;&#x4E0A;&#x201C;&#x6280;&#x672F;&#x5C0F;&#x767D;&#x201D;&#x7684;&#x6807;&#x7B7E;&#x4EE5;&#x514D;&#x8D3B;&#x7B11;&#x5927;&#x65B9;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x672C;&#x6587;&#x8FD8;&#x662F;&#x4E0D;&#x514D;&#x4F1A;&#x843D;&#x5165;&#x201C;&#x65B0;&#x624B;&#x4E0D;&#x61C2;&#xFF0C;&#x9AD8;&#x624B;&#x65E0;&#x7528;&#x201D;&#x7684;&#x5C34;&#x5C2C;&#x5883;&#x5730;&#xFF0C;&#x5C31;&#x53EA;&#x5F53;&#x4F5C;&#x662F;&#x5355;&#x7EAF;&#x5730;&#x4E3A;&#x4E86;&#x8BB0;&#x5F55;&#x4E0B;&#x6211;&#x5F00;&#x901A;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7684;&#x8FC7;&#x7A0B;&#x5427;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x8A00;&#x5F52;&#x6B63;&#x4F20;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x56DE;&#x7B54;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x7A76;&#x7ADF;&#x600E;&#x6837;&#x624D;&#x7B97;&#x662F;&#x201C;&#x50CF;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#x201D;&#xFF1F;&#x6211;&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x9762;&#x8BA4;&#x4E3A;&#x6700;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x50CF;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#xFF0C;&#x672A;&#x5FC5;&#x5C31;&#x662F;&#x5168;&#x7A0B;&#x770B;&#x4E0D;&#x5230;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF0C;&#x53EA;&#x4F1A;&#x4E00;&#x987F;&#x64CD;&#x4F5C;&#x731B;&#x5982;&#x864E;&#x5730;&#x72C2;&#x6572;&#x5404;&#x79CD;&#x4EE3;&#x7801;&#x548C;&#x547D;&#x4EE4;&#x3002;<a target="_blank" rel="noopener" href="https://wordpress.org/" title="external" target>WordPress</a>&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x6709;&#x4E00;&#x53E5;&#x4FDD;&#x7559;&#x81F3;&#x4ECA;&#x7684;&#x7ECF;&#x5178;&#x811A;&#x6CE8;&#xFF1A;</p>
<blockquote>
<p><strong>CODE IS POETRY</strong></p>
</blockquote>
<p>&#x7FFB;&#x8BD1;&#x6210;&#x4E2D;&#x6587;&#x6211;&#x4E00;&#x6837;&#x559C;&#x6B22;&#xFF1A;</p>
<blockquote>
<p><strong>&#x4EE3;&#x7801;&#x5982;&#x8BD7;</strong></p>
</blockquote>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x5B8C;&#x7F8E;&#x5730;&#x8BE0;&#x91CA;&#x4E86;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x5927;&#x7279;&#x70B9;&#xFF08;&#x540E;&#x9762;&#x6211;&#x4F1A;&#x8BF4;&#x5230;&#x53E6;&#x4E00;&#x7279;&#x70B9;&#xFF09;&#x2014;&#x2014;&#x4F18;&#x96C5;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x8BD7;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x6700;&#x7CBE;&#x70BC;&#x7684;&#xFF0C;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x4EA6;&#x5E94;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x4F55;&#x4E3A;&#x4F18;&#x96C5;&#xFF1F;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x4E3E;&#x91CD;&#x82E5;&#x8F7B;&#xFF0C;&#x6E38;&#x5203;&#x6709;&#x4F59;&#xFF0C;&#x7528;&#x4E09;&#x4E94;&#x5206;&#x7684;&#x6C14;&#x529B;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x5341;&#x5206;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x8C13;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x662F;&#x4E5F;&#x3002;&#x5F53;&#x7136;&#x4F18;&#x96C5;&#x4E0D;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x80CC;&#x540E;&#x9690;&#x85CF;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x5E73;&#x65F6;&#x6DF1;&#x539A;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x4E0D;&#x60DC;&#x7528;&#x4E00;&#x751F;&#x53BB;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x6781;&#x5176;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x6570;&#x7ECF;&#x8FC7;N&#x6B21;&#x5E73;&#x65B9;&#x589E;&#x957F;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">var</span> a = <span class="hljs-number">56</span>;</span><br><span class="line"><span class="hljs-keyword">var</span> n = <span class="hljs-number">10</span>;</span><br><span class="line"></span><br><span class="line"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; n; i++) {</span><br><span class="line">  a *= <span class="hljs-number">2</span>;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="hljs-built_in">console</span>.log(a);</span><br></pre></td></tr></tbody></table></figure>

<p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3A;&#x53D8;&#x91CF;a&#x548C;n&#x8D4B;&#x4E88;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x6765;&#x8BA1;&#x7B97;&#x4EFB;&#x4F55;&#x6570;&#x7ECF;&#x8FC7;&#x4EFB;&#x4F55;&#x6B21;&#x5E73;&#x65B9;&#x589E;&#x957F;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x8FD9;&#x6837;&#xFF09;&#x3002;&#x8BB2;&#x7A76;&#x4E00;&#x70B9;&#x5219;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x5199;&#x6210;&#x51FD;&#x6570;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sq_gr</span>(<span class="hljs-params">a, n</span>) </span>{</span><br><span class="line">  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; n; i++) {</span><br><span class="line">    a *= <span class="hljs-number">2</span>;</span><br><span class="line">  }</span><br><span class="line">  <span class="hljs-keyword">return</span> a;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="hljs-built_in">console</span>.log(sq_gr(<span class="hljs-number">56</span>, <span class="hljs-number">10</span>));</span><br></pre></td></tr></tbody></table></figure>

<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6240;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;&#x8FD9;&#x91CC;&#x662F;Javascript&#xFF09;&#x8DB3;&#x591F;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x5E42;&#x8FD0;&#x7B97;&#x7684;&#x65B9;&#x6CD5;&#x3002;Javascript&#x4E2D;&#x662F;&#x7528;Math&#x5BF9;&#x8C61;&#x7684;pow()&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x4EE5;&#x4E0A;&#x8FD0;&#x7B97;&#x4FBF;&#x53D8;&#x6210;&#x4E86;&#x6C42;&#x4E00;&#x4E2A;&#x6570;&#x4E0E;2&#x7684;N&#x6B21;&#x5E42;&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5C31;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">56</span> * <span class="hljs-built_in">Math</span>.pow(<span class="hljs-number">2</span>, <span class="hljs-number">10</span>));</span><br></pre></td></tr></tbody></table></figure>

<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x4E14;&#x9650;&#x5B9A;&#x88AB;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x6B63;&#x6574;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5176;&#x5B9E;&#x662F;&#x628A;&#x88AB;&#x64CD;&#x4F5C;&#x6570;&#x6309;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#x5411;&#x5DE6;&#x79FB;N&#x4F4D;&#xFF08;&#x5728;&#x4E0D;&#x8003;&#x8651;&#x6EA2;&#x51FA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">56</span> &lt;&lt; <span class="hljs-number">10</span>);</span><br></pre></td></tr></tbody></table></figure>

<p>&#x4EE5;&#x4E0A;&#x4F8B;&#x5B50;&#x6F14;&#x793A;&#x4E86;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x9010;&#x6E10;&#x5730;&#x5411;&#x4F18;&#x96C5;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x5728;&#x4E66;&#x5199;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E5F;&#x5728;&#x63D0;&#x9AD8;&#xFF08;&#x8FD9;&#x4E24;&#x8005;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6210;&#x6B63;&#x6BD4;&#xFF0C;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5982;&#x6B64;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8868;&#x660E;&#x4F18;&#x96C5;&#x7684;&#x80CC;&#x540E;&#x5176;&#x5B9E;&#x662F;&#x7EFC;&#x5408;&#x8FD0;&#x7528;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x5982;&#x8FD9;&#x91CC;&#x7684;&#x5E42;&#x8FD0;&#x7B97;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x79FB;&#x4F4D;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x597D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x903B;&#x8F91;&#x6027;&#x548C;&#x81EA;&#x6211;&#x89E3;&#x91CA;&#x6027;&#x3002;</p>
<blockquote><p>&#x8BA9;&#x4EE3;&#x7801;&#x81EA;&#x5DF1;&#x8BF4;&#x8BDD;</p>
<footer><strong>Venkat Subramaniam / Andy Hunt</strong><cite>&#x9AD8;&#x6548;&#x7A0B;&#x5E8F;&#x5458;&#x7684;45&#x4E2A;&#x4E60;&#x60EF;</cite></footer></blockquote>

<p>&#x4F60;&#x603B;&#x662F;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x6D77;&#x91CF;&#x7684;&#x6CE8;&#x91CA;&#x6700;&#x540E;&#x5374;&#x8FD8;&#x662F;&#x8BA9;&#x4EBA;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x8BE5;&#x505A;&#x7684;&#x4E0D;&#x662F;&#x63D0;&#x9AD8;&#x4E66;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x4FEE;&#x70BC;&#x4E00;&#x4E0B;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x529F;&#x529B;&#x3002;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x81EA;&#x5DF1;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x8FD9;&#x5305;&#x62EC;&#x5B8C;&#x7F8E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x548C;&#x547D;&#x540D;&#x7B49;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x5199;&#x7684;&#x6587;&#x7AE0;&#x603B;&#x662F;&#x8BA9;&#x4EBA;&#x4E00;&#x770B;&#x5C31;&#x61C2;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x5305;&#x542B;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x548C;&#x60EF;&#x5E38;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x9AD8;&#x5EA6;&#x8D34;&#x5408;&#x7684;&#x903B;&#x8F91;&#x601D;&#x8DEF;&#x8D70;&#x5411;&#x3002;&#x8BD5;&#x60F3;&#x4F60;&#x505C;&#x7559;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5B83;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x6D41;&#x51FA;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8D39;&#x529B;&#x5730;&#x53BB;&#x7406;&#x89E3;&#x3002;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x50CF;&#x827A;&#x672F;&#x54C1;&#x80FD;&#x5F15;&#x8D77;&#x89C2;&#x4F17;&#x7684;&#x5171;&#x9E23;&#x4E00;&#x6837;&#x8BA9;&#x4EBA;&#x4E00;&#x770B;&#x5C31;&#x61C2;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x597D;&#x7684;&#x6587;&#x7AE0;&#x4EA6;&#x5F53;&#x5982;&#x6B64;&#x3002;</p>
<h3 id="&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x7684;"><a href="#&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x7684;" class="headerlink" title="&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x7684;"></a>&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x7684;</h3><p>&#x4E0D;&#x3002;&#x6216;&#x8005;&#x8BF4;&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x5F3A;&#x5927;&#x5C31;&#x8D8A;&#x597D;&#xFF0C;&#x597D;&#x7684;&#x754C;&#x9762;&#x662F;&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#x7684;&#xFF0C;&#x591F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;</p>
<p>&#x5236;&#x4F5C;&#x754C;&#x9762;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x7684;&#x4F7F;&#x7528;&#x6548;&#x7387;&#x5219;&#x6781;&#x4F4E;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x80FD;&#x7701;&#x5219;&#x7701;"><a href="#&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x80FD;&#x7701;&#x5219;&#x7701;" class="headerlink" title="&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x80FD;&#x7701;&#x5219;&#x7701;"></a>&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x80FD;&#x7701;&#x5219;&#x7701;</h3><p>&#x548C;&#x754C;&#x9762;&#x4E00;&#x6837;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x4E5F;&#x5E94;&#x8BE5;&#x662F;&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#x7684;&#x3002;</p>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/24/su-min-ji/" itemprop="url">宿民记</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-23T18:29:33.000Z" itemprop="datePublished">8月 24 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/life/">生活</a><span>></span><a class="article-category-link" href="/categories/story/">故事</a><span>></span><a class="article-category-link" href="/categories/%E6%8A%80%E6%9C%AF%E5%B0%8F%E7%99%BD/">技术小白</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            26 分钟 读完 (约 3840 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><blockquote>
<p><small>&#x672C;&#x6587;&#x6700;&#x65E9;&#x53D1;&#x5E03;&#x4E8E;2018&#x5E74;11&#x6708;2&#x65E5;&#x7684;&#x540C;&#x540D;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x4E0A;&#x3002;</small></p>
</blockquote>
<p>&#x6211;&#x5BB6;&#x6709;&#x95F4;&#x5E38;&#x5E74;&#x95F2;&#x7F6E;&#x7684;&#x5BA2;&#x623F;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x5E74;&#x7F51;&#x4E0A;&#x6C11;&#x5BBF;&#x751F;&#x610F;&#x65B9;&#x5174;&#x672A;&#x827E;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x4F55;&#x4E0D;&#x628A;&#x5B83;&#x597D;&#x597D;&#x5E03;&#x7F6E;&#x4E00;&#x4E0B;&#x505A;&#x6210;&#x6C11;&#x5BBF;&#x6302;&#x5230;&#x7F51;&#x4E0A;&#xFF1F;&#x4E00;&#x6765;&#x53EF;&#x4EE5;&#x63A5;&#x5F85;&#x56DB;&#x65B9;&#x5BBE;&#x670B;&#xFF0C;&#x4E8C;&#x6765;&#x8FD8;&#x80FD;&#x987A;&#x4FBF;&#x8D5A;&#x70B9;&#x96F6;&#x82B1;&#x94B1;&#xFF0C;&#x771F;&#x662F;&#x4E24;&#x5168;&#x5176;&#x7F8E;&#xFF01;</p>
<p>&#x7406;&#x60F3;&#x5F88;&#x4E30;&#x6EE1;&#xFF0C;&#x73B0;&#x5B9E;&#x5F88;&#x9AA8;&#x611F;&#x3002;</p></body></html>
        <p class="article-more-link">
            <a href="/2020/08/24/su-min-ji/#more">阅读更多</a>
        </p>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/" itemprop="url">禅与摩托车维修艺术</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-21T19:59:33.000Z" itemprop="datePublished">8月 22 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/book/">读书</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            4 分钟 读完 (约 537 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><img src="/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/shutterstock_18369445777.jpg" class title="Zen and the Art of Motorcycle Maintenance">

<blockquote><p>&#x8FC7;&#x53BB;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x8BFB;&#x8FD9;&#x672C;400&#x9875;&#x7684;&#x4E66;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4ECA;&#x5E74;&#x8BFB;&#x8FC7;&#x7684;&#x6700;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x597D;&#x4E66;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x5B83;&#x5F88;&#x72EC;&#x7279;&#xFF0C;&#x4E00;&#x534A;&#x662F;&#x6E38;&#x8BB0;&#xFF0C;&#x8BB2;&#x8FF0;&#x4F5C;&#x8005;&#x4E0E;&#x513F;&#x5B50;&#x7684;&#x4E00;&#x6B21;&#x6469;&#x6258;&#x8F66;&#x65C5;&#x884C;&#xFF0C;&#x4ECE;&#x660E;&#x5C3C;&#x82CF;&#x8FBE;&#x5DDE;&#x4E00;&#x76F4;&#x5230;&#x52A0;&#x5DDE;&#xFF0C;&#x8017;&#x65F6;17&#x5929;&#xFF1B;&#x53E6;&#x4E00;&#x534A;&#x662F;&#x54F2;&#x5B66;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F5C;&#x8005;&#x5256;&#x6790;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5BFB;&#x6C42;&#x5FC3;&#x7075;&#x7684;&#x7B54;&#x6848;&#x3002;&#x4E24;&#x79CD;&#x6587;&#x4F53;&#x4EA4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x79F0;&#x5B83;&#x4E3A;&#x201D;&#x54F2;&#x5B66;&#x5C0F;&#x8BF4;&#x201D;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x6CE2;&#x897F;&#x683C;&#xFF08;1928-&#xFF0C;Robert M. Pirsig&#xFF09;&#x5927;&#x5B66;&#x65F6;&#x4E3B;&#x4FEE;&#x751F;&#x7269;&#x5316;&#x5B66;&#xFF0C;&#x540E;&#x6765;&#x5BF9;&#x54F2;&#x5B66;&#x4EA7;&#x751F;&#x5174;&#x8DA3;&#xFF0C;1950&#x5E74;&#x524D;&#x5F80;&#x5370;&#x5EA6;&#x5B66;&#x4E60;&#x4E1C;&#x65B9;&#x54F2;&#x5B66;&#x3002;&#x56DE;&#x56FD;&#x540E;&#xFF0C;&#x5728;&#x5F53;&#x5730;&#x5927;&#x5B66;&#x62C5;&#x4EFB;&#x5199;&#x4F5C;&#x8BFE;&#x6559;&#x5E08;&#x3002;1961&#x5E74;&#xFF0C;&#x4ED6;&#x88AB;&#x8BCA;&#x65AD;&#x4E3A;&#x504F;&#x6267;&#x578B;&#x7CBE;&#x795E;&#x5206;&#x88C2;&#x75C7;&#x548C;&#x4E34;&#x5E8A;&#x5FE7;&#x90C1;&#x75C7;&#xFF0C;&#x88AB;&#x591A;&#x6B21;&#x9001;&#x8FDB;&#x7CBE;&#x795E;&#x75C5;&#x9662;&#xFF0C;&#x63A5;&#x53D7;&#x8FC7;28&#x6B21;&#x7535;&#x51FB;&#x7597;&#x6CD5;&#x3002;</p>
<p>1968&#x5E74;&#x51FA;&#x9662;&#x540E;&#xFF0C;&#x4ED6;&#x5E26;&#x7740;10&#x5C81;&#x7684;&#x513F;&#x5B50;&#x514B;&#x91CC;&#x65AF;&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x957F;&#x9014;&#x6469;&#x6258;&#x8F66;&#x65C5;&#x884C;&#x3002;&#x4ED6;&#x628A;&#x65C5;&#x884C;&#x7684;&#x611F;&#x53D7;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x5199;&#x6210;&#x4E86;&#x4E00;&#x672C;&#x4E66;&#x300A;&#x7985;&#x4E0E;&#x6469;&#x6258;&#x8F66;&#x7EF4;&#x4FEE;&#x827A;&#x672F;&#x300B;&#xFF08;Zen and the Art of Motorcycle Maintenance&#xFF09;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FDE;&#x7EED;&#x88AB;121&#x5BB6;&#x51FA;&#x7248;&#x793E;&#x62D2;&#x7EDD;&#xFF0C;&#x76F4;&#x5230;1974&#x5E74;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x624D;&#x51FA;&#x7248;&#x3002;&#x4F46;&#x662F;&#x51FA;&#x7248;&#x540E;&#xFF0C;&#x9500;&#x552E;&#x91CF;&#x60CA;&#x4EBA;&#xFF0C;&#x8D85;&#x8FC7;500&#x4E07;&#x518C;&#xFF0C;&#x6210;&#x4E3A;70&#x5E74;&#x4EE3;&#x7F8E;&#x56FD;&#x5341;&#x5927;&#x7545;&#x9500;&#x4E66;&#x4E4B;&#x4E00;&#xFF0C;&#x76EE;&#x524D;&#x7D2F;&#x8BA1;&#x9500;&#x552E;&#x91CF;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;1000&#x4E07;&#x518C;&#x3002;&#x300A;&#x5409;&#x5C3C;&#x65AF;&#x4E16;&#x754C;&#x7EAA;&#x5F55;&#x300B;&#x79F0;&#x5B83;&#x662F;&#x201D;&#x4E16;&#x754C;&#x4E0A;&#x88AB;&#x62D2;&#x7A3F;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x7545;&#x9500;&#x4E66;&#x201D;&#x3002;</p>
<p>&#x6B64;&#x4E66;&#x5728;&#x56FD;&#x5185;&#x6709;&#x4E24;&#x4E2A;&#x4E2D;&#x6587;&#x7248;&#xFF1A;&#x300A;&#x7236;&#x5B50;&#x7684;&#x4E16;&#x754C;&#x300B;&#xFF08;&#x4E2D;&#x56FD;&#x53CB;&#x8C0A;&#x51FA;&#x7248;&#x516C;&#x53F8;&#xFF0C;&#x9EC4;&#x6B23;&#x8BD1;&#xFF0C;1999&#xFF09;&#x548C;&#x300A;&#x4E07;&#x91CC;&#x4EFB;&#x7985;&#x6E38;&#x300B;&#xFF08;&#x91CD;&#x5E86;&#x51FA;&#x7248;&#x793E;&#xFF0C;&#x5F20;&#x56FD;&#x8FB0;&#x8BD1;&#xFF0C;2006&#xFF09;&#x3002;&#x540E;&#x9762;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x4ECA;&#x5E74;9&#x6708;&#x5DF2;&#x7ECF;&#x518D;&#x7248;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x7EC8;&#x4E8E;&#x5C06;&#x4E66;&#x540D;&#x6539;&#x6210;&#x539F;&#x540D;&#x4E86;&#x3002;&#x7F51;&#x4E0A;&#x6709;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x7FFB;&#x8BD1;&#x5F97;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x3002;</p>
<footer><strong>&#x962E;&#x4E00;&#x5CF0;</strong><cite><a target="_blank" rel="noopener" href="http://www.ruanyifeng.com/blog/2011/12/zen_and_the_art_of_motorcycle_maintenance.html">&#x300A;&#x7985;&#x4E0E;&#x6469;&#x6258;&#x8F66;&#x7EF4;&#x4FEE;&#x827A;&#x672F;&#x300B;&#x8BFB;&#x540E;&#x611F;</a></cite></footer></blockquote></body></html>
    
    </div>
    
    
</article>




    
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 胡芍&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    
<script src="/js/jquery.js"></script>


<script src="/js/moment-with-locales.js"></script>


<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>

<script src="/js/outdatedbrowser.js"></script>

<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>




<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>