<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>只是胡闹</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">


<link rel="stylesheet" href="/css/outdatedbrowser.css">





<meta name="description" content="">







<link rel="alternative" href="/atom.xml" title="只是胡闹" type="application/atom+xml">




<!--<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">-->

<link rel="stylesheet" href="/css/bulma.css">




<link rel="stylesheet" href="/css/lightgallery.css">


<link rel="stylesheet" href="/css/justifiedGallery.css">




<link rel="stylesheet" href="/css/atom-one-light.css">



<link rel="stylesheet" href="/css/style.css">



<script src="/js/fontawesome-all.js"></script>




<meta name="generator" content="Hexo 5.0.2"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    <img src="/images/logo.png" alt="" height="28">
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/life">生活</a>
            
            <a class="navbar-item "
               href="/categories/book">读书</a>
            
            <a class="navbar-item "
               href="/categories/music">爱乐</a>
            
            <a class="navbar-item "
               href="/categories/art">品艺</a>
            
            <a class="navbar-item "
               href="/categories/movie">观影</a>
            
            <a class="navbar-item "
               href="/categories/technology">探技</a>
            
            <a class="navbar-item "
               href="/categories/story">故事</a>
            
            <a class="navbar-item "
               href="/archives">所有文章</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/ppoffice/hexo-theme-minos">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2021/06/07/A4%E7%BA%B8%E7%9A%84%E5%A4%A7%E5%B0%8F%E5%92%8C%E5%8D%81%E4%BA%8C%E5%B9%B3%E5%9D%87%E5%BE%8B/" itemprop="url">A4纸的大小和十二平均律</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2021-06-07T12:21:13.000Z" itemprop="datePublished">6月 7 2021</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/book/">读书</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            9 分钟 读完 (约 1390 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x524D;&#x51E0;&#x5929;&#x5728;&#x4E50;&#x56E2;&#x7FA4;&#x804A;&#x91CC;&#x804A;&#x5230;&#x97F3;&#x5F8B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x804A;&#x5174;&#x9887;&#x8DB3;&#xFF0C;&#x8FD8;&#x81EA;&#x4EE5;&#x4E3A;&#x662F;&#x5730;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x756A;&#x201C;&#x9AD8;&#x8BBA;&#x201D;&#xFF1A;</p>
<blockquote>
<p>&#x5728;&#x5DF2;&#x77E5;&#x57FA;&#x51C6;&#x97F3;&#x9891;&#x7387;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5229;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x6C42;&#x5341;&#x4E8C;&#x5E73;&#x5747;&#x5F8B;&#x4E0B;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x97F3;&#x7684;&#x9891;&#x7387;&#xFF1A;</p>
<figure class="highlight plain hljs"><table><tbody><tr><td class="code"><pre><span class="line">&#x76EE;&#x6807;&#x97F3;&#x9891;&#x7387; = &#x57FA;&#x51C6;&#x97F3;&#x9891;&#x7387; &#xF7; 12 &#xD7; &#x76EE;&#x6807;&#x97F3;&#x548C;&#x57FA;&#x51C6;&#x97F3;&#x4E4B;&#x95F4;&#x7684;&#x534A;&#x97F3;&#x4E2A;&#x6570;</span><br></pre></td></tr></tbody></table></figure>
</blockquote>
<p><strong>&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF01;</strong></p>
<p>&#x4EE5;&#x57FA;&#x51C6;&#x97F3;&#x4E3A;a1&#xFF08;&#x9891;&#x7387;440&#x8D6B;&#x5179;&#xFF09;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x7528;&#x4EE5;&#x4E0A;&#x516C;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#x5176;&#x4E0A;&#x65B9;&#x4E94;&#x5EA6;&#x97F3;e2&#x7684;&#x9891;&#x7387;&#xFF0C;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;440 &#xF7; 12 &#xD7; 7 = 696.666666&#x2026;.&#xFF0C;&#x8FD9;&#x6839;&#x672C;&#x4E0D;&#x662F;e2&#x7684;&#x9891;&#x7387;&#xFF0C;&#x800C;&#x662F;&#x5DF2;&#x7ECF;&#x5FEB;&#x63A5;&#x8FD1;f2&#x7684;&#x9891;&#x7387;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x975E;&#x5E38;&#x5173;&#x952E;&#x6027;&#x7684;&#x9519;&#x8BEF;&#x662F;&#xFF1A;&#x6211;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x8BEF;&#x89E3;&#x4E86;&#x5341;&#x4E8C;&#x5E73;&#x5747;&#x5F8B;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4E2D;&#x201C;&#x5E73;&#x5747;&#x201D;&#x4E00;&#x8BCD;&#x7684;&#x542B;&#x4E49;&#x3002;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x662F;&#x97F3;&#x4E50;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#xFF0C;&#x72AF;&#x4E0B;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x60C5;&#x6709;&#x53EF;&#x539F;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x4E3A;&#x6211;&#x7684;&#x5B66;&#x827A;&#x4E0D;&#x7CBE;&#x53C8;&#x7231;&#x778E;&#x8868;&#x73B0;&#x800C;&#x611F;&#x5230;&#x6DF1;&#x6DF1;&#x7684;&#x60ED;&#x6127;&#x3002;</p>
<p>&#x8BFB;&#x8005;&#x5982;&#x679C;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x6B63;&#x786E;&#x7B54;&#x6848;&#xFF0C;&#x4E0D;&#x59A8;&#x5148;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x5C06;&#x5728;&#x672C;&#x6587;&#x7684;&#x672B;&#x5C3E;&#x63ED;&#x6653;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x5148;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x53E6;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x5B83;&#x6765;&#x81EA;&#x6211;&#x6B63;&#x5728;&#x8BFB;&#x7684;&#x4E00;&#x672C;&#x4E66;&#x2014;&#x2014;&#x300A;&#x6B22;&#x4E50;&#x6570;&#x5B66;&#x300B;&#xFF08;&#x82F1;&#x6587;&#x539F;&#x540D;&#xFF1A;Math with Bad Drawings&#xFF09;&#x3002;</p>
<h3 id="&#x6570;&#x5B66;&#x548C;&#x70C2;&#x63D2;&#x753B;"><a href="#&#x6570;&#x5B66;&#x548C;&#x70C2;&#x63D2;&#x753B;" class="headerlink" title="&#x6570;&#x5B66;&#x548C;&#x70C2;&#x63D2;&#x753B;"></a>&#x6570;&#x5B66;&#x548C;&#x70C2;&#x63D2;&#x753B;</h3><p>&#x8FD9;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x82F1;&#x6587;&#x539F;&#x540D; Math with Bad Drawings &#x7684;&#x76F4;&#x8BD1;&#x3002;&#xFF08;&#x8001;&#x5B9E;&#x8BF4;&#xFF0C;&#x201C;&#x70C2;&#x63D2;&#x753B;&#x201D;&#x8FD9;&#x4E2A;&#x7528;&#x8BED;&#x662F;&#x4F5C;&#x8005;&#x7684;&#x81EA;&#x8C26;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x753B;&#x5F97;&#x8FD8;&#x662F;&#x633A;&#x4E0D;&#x9519;&#x7684;&#x3002;&#xFF09;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x8BD5;&#x56FE;&#x4EE5;&#x6700;&#x6D45;&#x663E;&#x6613;&#x61C2;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4ECB;&#x7ECD;&#x5E38;&#x7528;&#x7684;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x4F5C;&#x8005;&#x4E0D;&#x60DC;&#x8FD0;&#x7528;&#x5927;&#x91CF;&#x98CE;&#x8DA3;&#x5E7D;&#x9ED8;&#x7684;&#x6BD4;&#x55BB;&#x548C;&#x8BA9;&#x4EBA;&#x5FCD;&#x4FCA;&#x4E0D;&#x7981;&#x7684;&#x6F2B;&#x753B;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x8981;&#x8BB2;&#x8FF0;&#x7684;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#x90FD;&#x8D2F;&#x7A7F;&#x5728;&#x73B0;&#x5B9E;&#x7684;&#x4F8B;&#x5B50;&#x5F53;&#x4E2D;&#xFF0C;&#x4E66;&#x4E2D;&#x7684;&#x6570;&#x5B66;&#x4F3C;&#x4E4E;&#x4E0D;&#x518D;&#x662F;&#x62BD;&#x8C61;&#x96BE;&#x61C2;&#x7684;&#x516C;&#x5F0F;&#x548C;&#x5B9A;&#x7406;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x4EEC;&#x8EAB;&#x8FB9;&#x6D3B;&#x751F;&#x751F;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x753B;&#x98CE;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;&#xFF1A;</p>
<p>&#x5E76;&#x4E14;&#xFF0C;&#x4F5C;&#x8005;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x7684;&#x5E05;&#x54E5;&#xFF1A;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x5F15;&#x7528;&#x7684;&#x662F;&#x8BE5;&#x4E66;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x4E2D;&#x7684;&#x4E00;&#x7AE0;&#xFF1A;A4&#x7EB8;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4F5C;&#x8005;&#x662F;&#x7F8E;&#x56FD;&#x4EBA;&#xFF0C;&#x5728;&#x82F1;&#x56FD;&#x5DE5;&#x4F5C;&#x671F;&#x95F4;&#x975E;&#x5E38;&#x4E0D;&#x4E60;&#x60EF;&#x4F7F;&#x7528;A4&#x7EB8;&#x529E;&#x516C;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x5927;&#x5BB6;&#x666E;&#x904D;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x53EB;&#x4F5C;&#x4FE1;&#x7EB8;&#xFF08;Letter&#xFF09;&#x7684;&#x7EB8;&#x5F20;&#x5C3A;&#x5BF8;&#xFF0C;&#x5B83;&#x7684;&#x5BBD;&#x5EA6;&#x662F;8.5&#x82F1;&#x5BF8;&#xFF0C;&#x9AD8;&#x5EA6;&#x662F;11&#x82F1;&#x5BF8;&#xFF0C;&#x800C;A4&#x7EB8;&#x7684;&#x5BBD;&#x548C;&#x9AD8;&#x5219;&#x5206;&#x522B;&#x4E3A;21cm&#x548C;29.7cm&#x3002;&#x73B0;&#x5728;&#x4F60;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x7406;&#x89E3;&#x4F5C;&#x8005;&#x7684;&#x56F0;&#x60D1;&#xFF1A;&#x76F8;&#x6BD4;&#x540E;&#x8005;&#xFF0C;&#x524D;&#x9762;&#x90A3;&#x4E2A;&#x5C3A;&#x5BF8;&#x542C;&#x4E0A;&#x53BB;&#x8212;&#x670D;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;210&#xD7;297&#xFF0C;&#x8FD9;&#x662F;&#x54EA;&#x95E8;&#x5B50;&#x7684;&#x5C3A;&#x5BF8;&#xFF1F;&#x8BE5;&#x4E0D;&#x4F1A;&#x662F;&#x54EA;&#x4E2A;&#x75AF;&#x5B50;&#x60F3;&#x51FA;&#x6765;&#x7684;&#x5427;&#xFF1F;</p>
<p>&#x7136;&#x800C;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;A4&#x662F;&#x76EE;&#x524D;&#x5168;&#x4E16;&#x754C;&#x4F7F;&#x7528;&#x6700;&#x666E;&#x904D;&#x7684;&#x529E;&#x516C;&#x7528;&#x7EB8;&#x3002;A4&#x53EA;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7EB8;&#x5F20;&#x5C3A;&#x5BF8;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;A0&#xFF0C;A1&#xFF0C;&#x2026;&#x4E00;&#x76F4;&#x5230;A5&#x751A;&#x81F3;&#x66F4;&#x5C0F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5C3A;&#x5BF8;&#x7684;&#x9AD8;&#x5BBD;&#x6BD4;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x4E3A;&#x795E;&#x5947;&#x7684;&#x662F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E24;&#x5F20;&#x76F8;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x7EB8;&#x5F20;&#x5E76;&#x6392;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x62FC;&#x6210;&#x4E00;&#x5F20;&#x6BD4;&#x5B83;&#x5927;&#x4E00;&#x53F7;&#x7684;&#x7EB8;&#x5F20;&#x3002;&#x8FD9;&#xFF0C;&#x5C31;&#x662F;A4&#x7EB8;&#x7684;&#x5965;&#x5999;&#x6240;&#x5728;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x9AD8;&#x5BBD;&#x6BD4;&#x7A76;&#x7ADF;&#x8981;&#x5B9A;&#x4E3A;&#x591A;&#x5C11;&#xFF0C;&#x624D;&#x80FD;&#x6EE1;&#x8DB3;&#x4E0A;&#x8FF0;&#x6761;&#x4EF6;&#x5462;&#xFF1F;</p>
<p>&#x597D;&#xFF0C;&#x6570;&#x5B66;&#x5F00;&#x59CB;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x9AD8;&#x5BBD;&#x6BD4;&#x4E3A;<em>q_&#xFF08;&#x540E;&#x9762;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x5B57;&#x6BCD;&#x662F;&#x6709;&#x7528;&#x610F;&#x7684;&#xFF09;&#xFF0C;&#x518D;&#x9009;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x5C3A;&#x5BF8;&#x7684;&#x5BBD;&#xFF0C;&#x4EE4;&#x5B83;&#x4E3A;1&#x3002;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x5C3A;&#x5BF8;&#x7684;&#x9AD8;&#x5BBD;&#x6BD4;&#x90FD;&#x662F;_q_&#xFF0C;&#x53EF;&#x77E5;&#x8FD9;&#x4E2A;&#x5C3A;&#x5BF8;&#x7684;&#x9AD8;&#x5EA6;&#x662F;1 * _q</em> = <em>q_&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x53C8;&#x6B63;&#x597D;&#x662F;&#x6BD4;&#x5B83;&#x5927;&#x4E00;&#x53F7;&#x7684;&#x7EB8;&#x5F20;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x8FDB;&#x800C;&#x53EF;&#x4EE5;&#x9000;&#x51FA;&#xFF0C;&#x5927;&#x4E00;&#x53F7;&#x7EB8;&#x5F20;&#x7684;&#x9AD8;&#x5EA6;&#x662F;&#xFF1A;_q</em> * <em>q</em> = q^2&#x3002;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x5217;&#xFF1A;</p>
<figure class="highlight plain hljs"><table><tbody><tr><td class="code"><pre><span class="line">1&#xFF0C;q, q^2, q^3, ....</span><br></pre></td></tr></tbody></table></figure>

<p>&#x5982;&#x679C;&#x5927;&#x5BB6;&#x8FD8;&#x80FD;&#x56DE;&#x5FC6;&#x8D77;&#x4E2D;&#x5B66;&#x65F6;&#x5B66;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5E94;&#x8BE5;&#x8BB0;&#x5F97;&#x8FD9;&#x4E2A;&#x6570;&#x5217;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x53EB;&#x4F5C;<strong>&#x7B49;&#x6BD4;&#x6570;&#x5217;</strong>&#xFF0C;&#x800C;_q_&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7B49;&#x6BD4;&#x6570;&#x5217;&#x7684;<strong>&#x516C;&#x6BD4;</strong>&#x3002;&#x73B0;&#x5728;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;q&#x8FD9;&#x4E2A;&#x5B57;&#x6BCD;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x7B49;&#x6BD4;&#x6570;&#x5217;&#x7684;&#x516C;&#x6BD4;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x7684;&#x7EA6;&#x5B9A;&#x79F0;&#x547C;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x6C42;&#x51FA;q&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x89E3;&#x5F00;&#x4E86;&#xFF0C;&#x522B;&#x5FD8;&#x4E86;&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7528;&#x4E0A;&#x7684;&#x6761;&#x4EF6;&#xFF1A;&#x4E24;&#x5F20;&#x5C0F;&#x53F7;&#x7EB8;&#x5F20;&#x5E76;&#x6392;&#x6446;&#x653E;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x62FC;&#x51FA;&#x4E00;&#x5F20;&#x5927;&#x53F7;&#x7EB8;&#x5F20;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5927;&#x53F7;&#x7EB8;&#x5F20;&#x7684;&#x9AD8;&#x662F;&#x5C0F;&#x53F7;&#x7EB8;&#x5F20;&#x5BBD;&#x7684;&#x4E24;&#x500D;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x6211;&#x4EEC;&#x53EF;&#x5F97;&#x51FA;&#x4E0B;&#x9762;&#x7684;&#x516C;&#x5F0F;&#xFF1A;</p>
<figure class="highlight plain hljs"><table><tbody><tr><td class="code"><pre><span class="line">q^2 = 2</span><br></pre></td></tr></tbody></table></figure>

<p>&#x4ECE;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x4E2D;&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#xFF0C;q&#x7684;&#x503C;&#x6B63;&#x597D;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x65E0;&#x7406;&#x6570;&#xFF1A;&#x6839;&#x53F7;2&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x7684;&#x9AD8;&#x5BBD;&#x6BD4;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x518D;&#x53BB;&#x89C2;&#x5BDF;A4&#x7EB8;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x7684;&#x9AD8;297&#x53BB;&#x9664;&#x4EE5;&#x5B83;&#x7684;&#x5BBD;210&#xFF0C;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x662F;1.41428571&#xFF0C;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x7B49;&#x540C;&#x4E8E;&#x6839;&#x53F7;2&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<h3 id="&#x201C;A4&#x7EB8;&#x201D;&#x7406;&#x8BBA;&#x7684;&#x63A8;&#x5E7F;"><a href="#&#x201C;A4&#x7EB8;&#x201D;&#x7406;&#x8BBA;&#x7684;&#x63A8;&#x5E7F;" class="headerlink" title="&#x201C;A4&#x7EB8;&#x201D;&#x7406;&#x8BBA;&#x7684;&#x63A8;&#x5E7F;"></a>&#x201C;A4&#x7EB8;&#x201D;&#x7406;&#x8BBA;&#x7684;&#x63A8;&#x5E7F;</h3><p>&#x201C;&#x5C31;&#x8FD9;&#xFF1F;&#x201D;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x201C;&#x4E5F;&#x4E0D;&#x8FC7;&#x5982;&#x6B64;&#x561B;&#xFF01;&#x201D;</p>
<p>&#x522B;&#x6025;&#xFF0C;&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x94FA;&#x57AB;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x624D;&#x771F;&#x6B63;&#x8981;&#x8FDB;&#x5165;&#x5230;&#x7CBE;&#x5F69;&#x7684;&#x90E8;&#x5206;&#x4E86;&#x3002;</p>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/27/%E5%A6%82%E4%BD%95%E5%83%8F%E7%A8%8B%E5%BA%8F%E5%91%98%E4%B8%80%E6%A0%B7%E5%86%99%E4%BD%9C/" itemprop="url">如何像程序员一样写作</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-26T16:23:29.000Z" itemprop="datePublished">8月 27 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/technology/">探技</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            18 分钟 读完 (约 2749 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x7684;&#x6807;&#x9898;&#x515A;&#xFF0C;&#x6291;&#x6216;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x4E3A;&#x6211;&#x62D9;&#x52A3;&#x7684;&#x5E7D;&#x9ED8;&#x611F;&#x3002;&#x5982;&#x679C;Hexo&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x6807;&#x8BB0;&#x4E00;&#x7BC7;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x4F1A;&#x7ED9;&#x672C;&#x7BC7;&#x52A0;&#x4E0A;&#x201C;&#x6280;&#x672F;&#x5C0F;&#x767D;&#x201D;&#x7684;&#x6807;&#x7B7E;&#x4EE5;&#x514D;&#x8D3B;&#x7B11;&#x5927;&#x65B9;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x672C;&#x6587;&#x8FD8;&#x662F;&#x4E0D;&#x514D;&#x4F1A;&#x843D;&#x5165;&#x201C;&#x65B0;&#x624B;&#x4E0D;&#x61C2;&#xFF0C;&#x9AD8;&#x624B;&#x65E0;&#x7528;&#x201D;&#x7684;&#x5C34;&#x5C2C;&#x5883;&#x5730;&#xFF0C;&#x5C31;&#x53EA;&#x5F53;&#x4F5C;&#x662F;&#x5355;&#x7EAF;&#x5730;&#x4E3A;&#x4E86;&#x8BB0;&#x5F55;&#x4E0B;&#x6211;&#x5F00;&#x901A;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7684;&#x8FC7;&#x7A0B;&#x5427;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x8A00;&#x5F52;&#x6B63;&#x4F20;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x56DE;&#x7B54;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x7A76;&#x7ADF;&#x600E;&#x6837;&#x624D;&#x7B97;&#x662F;&#x201C;&#x50CF;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#x201D;&#xFF1F;&#x6211;&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5FC3;&#x91CC;&#x9762;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x8BA4;&#x4E3A;&#x6700;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x50CF;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#xFF0C;&#x672A;&#x5FC5;&#x5C31;&#x662F;&#x5168;&#x7A0B;&#x770B;&#x4E0D;&#x5230;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF0C;&#x53EA;&#x4F1A;&#x4E00;&#x987F;&#x64CD;&#x4F5C;&#x731B;&#x5982;&#x864E;&#x5730;&#x72C2;&#x6572;&#x5404;&#x79CD;&#x4EE3;&#x7801;&#x548C;&#x547D;&#x4EE4;&#x3002;<a target="_blank" rel="noopener" href="https://wordpress.org/" title="external" target>WordPress</a>&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x6709;&#x4E00;&#x53E5;&#x4FDD;&#x7559;&#x81F3;&#x4ECA;&#x7684;&#x7ECF;&#x5178;&#x811A;&#x6CE8;&#xFF1A;</p>
<blockquote>
<p><strong>CODE IS POETRY</strong></p>
</blockquote>
<p>&#x7FFB;&#x8BD1;&#x6210;&#x4E2D;&#x6587;&#x6211;&#x4E00;&#x6837;&#x559C;&#x6B22;&#xFF1A;</p>
<blockquote>
<p><strong>&#x4EE3;&#x7801;&#x5982;&#x8BD7;</strong></p>
</blockquote>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x5B8C;&#x7F8E;&#x5730;&#x8BE0;&#x91CA;&#x4E86;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x5927;&#x7279;&#x70B9;&#xFF08;&#x540E;&#x9762;&#x6211;&#x4F1A;&#x8BF4;&#x5230;&#x53E6;&#x4E00;&#x7279;&#x70B9;&#xFF09;&#x2014;&#x2014;&#x4F18;&#x96C5;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x8BD7;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x6700;&#x7CBE;&#x70BC;&#x7684;&#xFF0C;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x4EA6;&#x5E94;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x4F55;&#x4E3A;&#x4F18;&#x96C5;&#xFF1F;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x4E3E;&#x91CD;&#x82E5;&#x8F7B;&#xFF0C;&#x6E38;&#x5203;&#x6709;&#x4F59;&#xFF0C;&#x7528;&#x4E09;&#x4E94;&#x5206;&#x7684;&#x6C14;&#x529B;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x5341;&#x5206;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x8C13;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x662F;&#x4E5F;&#x3002;&#x5F53;&#x7136;&#x4F18;&#x96C5;&#x4E0D;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x80CC;&#x540E;&#x9690;&#x85CF;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x5E73;&#x65F6;&#x6DF1;&#x539A;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x4E0D;&#x60DC;&#x7528;&#x4E00;&#x751F;&#x53BB;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x6781;&#x5176;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x6570;&#x7ECF;&#x8FC7;N&#x6B21;&#x4E8C;&#x500D;&#x589E;&#x957F;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;56&#x7ECF;&#x8FC7;&#x82E5;&#x5E72;&#x6B21;&#x4E8C;&#x500D;&#x589E;&#x957F;&#x540E;&#x4F9D;&#x6B21;&#x4E3A;&#xFF1A;118, 236, 472&#x2026; &#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">twice</span>(<span class="hljs-params">a, n</span>) </span>{</span><br><span class="line">  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; n; i++) {</span><br><span class="line">    a *= <span class="hljs-number">2</span>;</span><br><span class="line">  }</span><br><span class="line">  <span class="hljs-keyword">return</span> a;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="hljs-built_in">console</span>.log(twice(<span class="hljs-number">56</span>, <span class="hljs-number">10</span>));</span><br></pre></td></tr></tbody></table></figure>

<p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;56&#x5728;&#x7ECF;&#x8FC7;10&#x6B21;&#x4E8C;&#x500D;&#x589E;&#x957F;&#x8FC7;&#x540E;&#x7684;&#x503C;&#xFF1A;57344&#x3002;&#x5B66;&#x8FC7;&#x7B97;&#x6CD5;&#x7684;&#x540C;&#x5B66;&#x5E94;&#x8BE5;&#x4E00;&#x773C;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x662F;O(n)&#xFF0C;&#x5373;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4F1A;&#x968F;&#x7740;n&#x7684;&#x589E;&#x52A0;&#x5448;&#x7EBF;&#x6027;&#x589E;&#x957F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5355;&#x5C42;&#x5FAA;&#x73AF;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6240;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;&#x8FD9;&#x91CC;&#x662F;Javascript&#xFF09;&#x8DB3;&#x591F;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x5E42;&#x8FD0;&#x7B97;&#x7684;&#x65B9;&#x6CD5;&#x3002;Javascript&#x4E2D;&#x662F;&#x7528;Math&#x5BF9;&#x8C61;&#x7684;pow()&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x4EE5;&#x4E0A;&#x8FD0;&#x7B97;&#x4FBF;&#x53D8;&#x6210;&#x4E86;&#x6C42;&#x4E00;&#x4E2A;&#x6570;&#x4E0E;2&#x7684;N&#x6B21;&#x5E42;&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5C31;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">56</span> * <span class="hljs-built_in">Math</span>.pow(<span class="hljs-number">2</span>, <span class="hljs-number">10</span>));</span><br></pre></td></tr></tbody></table></figure>

<p>&#x6211;&#x4EEC;&#x76F8;&#x4FE1;Javascript&#x7684;&#x5E42;&#x8FD0;&#x7B97;&#x662F;&#x7ECF;&#x8FC7;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x6709;&#x7740;&#x5E38;&#x6570;&#x7EA7;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x662F;O(1)&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x4E14;&#x9650;&#x5B9A;&#x88AB;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x6B63;&#x6574;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x628A;&#x88AB;&#x64CD;&#x4F5C;&#x6570;&#x6309;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#x5411;&#x5DE6;&#x79FB;N&#x4F4D;&#xFF08;&#x5728;&#x4E0D;&#x8003;&#x8651;&#x6EA2;&#x51FA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#xFF1A;</p>
<figure class="highlight javascript hljs"><figcaption><span>Javascript</span></figcaption><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-built_in">console</span>.log(<span class="hljs-number">56</span> &lt;&lt; <span class="hljs-number">10</span>);</span><br></pre></td></tr></tbody></table></figure>

<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x4F9D;&#x7136;&#x662F;O(1)&#xFF0C;&#x4F46;&#x6392;&#x9664;&#x901A;&#x7528;&#x6027;&#x7684;&#x5F0A;&#x7AEF;&#xFF0C;&#x79FB;&#x4F4D;&#x8FD0;&#x7B97;&#x7684;&#x6548;&#x7387;&#x663E;&#x7136;&#x6BD4;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8981;&#x9AD8;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x4F8B;&#x5B50;&#x6F14;&#x793A;&#x4E86;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x9010;&#x6E10;&#x5730;&#x5411;&#x4F18;&#x96C5;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x5728;&#x4E66;&#x5199;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E5F;&#x5728;&#x63D0;&#x9AD8;&#xFF08;&#x8FD9;&#x4E24;&#x8005;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6210;&#x6B63;&#x6BD4;&#xFF0C;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5982;&#x6B64;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8868;&#x660E;&#x4F18;&#x96C5;&#x7684;&#x80CC;&#x540E;&#x5176;&#x5B9E;&#x662F;&#x7EFC;&#x5408;&#x8FD0;&#x7528;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x5982;&#x8FD9;&#x91CC;&#x7684;&#x5E42;&#x8FD0;&#x7B97;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x79FB;&#x4F4D;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x597D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x826F;&#x597D;&#x7684;&#x903B;&#x8F91;&#x6027;&#x548C;&#x81EA;&#x6211;&#x89E3;&#x91CA;&#x6027;&#x3002;</p>
<blockquote><p>&#x8BA9;&#x4EE3;&#x7801;&#x81EA;&#x5DF1;&#x8BF4;&#x8BDD;</p>
<footer><strong>Venkat Subramaniam / Andy Hunt</strong><cite>&#x9AD8;&#x6548;&#x7A0B;&#x5E8F;&#x5458;&#x7684;45&#x4E2A;&#x4E60;&#x60EF;</cite></footer></blockquote>

<p>&#x5982;&#x679C;&#x4F60;&#x603B;&#x662F;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x4E66;&#x5199;&#x6D77;&#x91CF;&#x7684;&#x6CE8;&#x91CA;&#x6700;&#x540E;&#x5374;&#x8FD8;&#x662F;&#x8BA9;&#x4EBA;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x8BE5;&#x505A;&#x7684;&#x4E0D;&#x662F;&#x53BB;&#x63D0;&#x5347;&#x6587;&#x7B14;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x4FEE;&#x70BC;&#x4E00;&#x4E0B;&#x7F16;&#x7801;&#x7684;&#x80FD;&#x529B;&#x3002;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x81EA;&#x5DF1;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x8FD9;&#x5305;&#x62EC;&#x5B8C;&#x7F8E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x548C;&#x547D;&#x540D;&#x7B49;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x601D;&#x8DEF;&#x5E94;&#x8BE5;&#x548C;&#x60EF;&#x5E38;&#x7684;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x9AD8;&#x5EA6;&#x5951;&#x5408;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x6E05;&#x5947;&#x7684;&#x8111;&#x56DE;&#x8DEF;&#x201D;&#x5F80;&#x5F80;&#x4E0D;&#x4F46;&#x4E0D;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x4F1A;&#x6270;&#x4E71;&#x4ED6;&#x4EBA;&#x7684;&#x601D;&#x8003;&#x8282;&#x594F;&#x3002;&#x8BD5;&#x60F3;&#x4F60;&#x505C;&#x7559;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5B83;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x663E;&#x9732;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5341;&#x5206;&#x8D39;&#x529B;&#x5730;&#x53BB;&#x63E3;&#x6469;&#x3002;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x50CF;&#x80FD;&#x5F15;&#x8D77;&#x89C2;&#x4F17;&#x5171;&#x9E23;&#x7684;&#x827A;&#x672F;&#x54C1;&#x4E00;&#x6837;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x80FD;&#x4E00;&#x770B;&#x5C31;&#x61C2;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8BA9;&#x4EBA;&#x7531;&#x8877;&#x611F;&#x53F9;&#x201C;&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x6240;&#x60F3;&#x7684;&#x201D;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x6700;&#x9002;&#x5408;&#x5199;&#x4F5C;&#x7684;&#x804C;&#x4E1A;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x5199;&#x4F5C;&#x548C;&#x7F16;&#x7A0B;&#xFF0C;&#x4E8C;&#x8005;&#x4F55;&#x5176;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF1F;&#xFF01;&#x575A;&#x6301;&#x5199;&#x4F5C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x4F18;&#x96C5;&#xFF1B;&#x800C;&#x628A;&#x5904;&#x7406;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#x7684;&#x601D;&#x7EF4;&#x5E94;&#x7528;&#x5230;&#x5199;&#x4F5C;&#x4E0A;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5199;&#x51FA;&#x7684;&#x6587;&#x7AE0;&#x66F4;&#x5177;&#x6709;&#x6761;&#x7406;&#x6027;&#xFF0C;&#x903B;&#x8F91;&#x66F4;&#x52A0;&#x4E25;&#x8C28;&#xFF0C;&#x66F4;&#x52A0;&#x7B80;&#x660E;&#x6613;&#x61C2;&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x9A7E;&#x8F7B;&#x5C31;&#x719F;&#x5730;&#x9610;&#x8FF0;&#x4F60;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4F60;&#x5FC5;&#x7136;&#x8981;&#x6CE8;&#x91CD;&#x5E73;&#x65F6;&#x7684;&#x77E5;&#x8BC6;&#x79EF;&#x7D2F;&#xFF0C;&#x7528;&#x4E09;&#x4E94;&#x5206;&#x7684;&#x6C14;&#x529B;&#x5C31;&#x80FD;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#x5341;&#x5206;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;"><a href="#&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;" class="headerlink" title="&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;"></a>&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;</h3><p>&#x5927;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x75F4;&#x8FF7;&#x4E8E;&#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x2014;&#x2014;&#x7F16;&#x7A0B;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x9879;&#x628A;&#x91CD;&#x590D;&#x4EFB;&#x52A1;&#x81EA;&#x52A8;&#x5316;&#x548C;&#x673A;&#x68B0;&#x5316;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x548C;&#x5DE5;&#x5177;&#x8BDE;&#x751F;&#x7684;&#x521D;&#x8877;&#x5982;&#x51FA;&#x4E00;&#x8F99;&#x3002;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x5E7F;&#x4E49;&#x4E0A;&#x7684;&#xFF0C;&#x4E0D;&#x5355;&#x6307;&#x770B;&#x5F97;&#x89C1;&#x6478;&#x5F97;&#x7740;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x6280;&#x672F;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x53CA;&#x5E73;&#x53F0;&#x3001;&#x6846;&#x67B6;&#x548C;&#x7406;&#x8BBA;&#x4F53;&#x7CFB;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x867D;&#x8BF4;&#x201C;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#xFF0C;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#x201D;&#xFF0C;&#x7136;&#x800C;&#x6C89;&#x8FF7;&#x4E8E;&#x5DE5;&#x5177;&#x5219;&#x4F1A;&#x8FC7;&#x72B9;&#x4E0D;&#x53CA;&#x3002;&#x4F7F;&#x7528;&#x4F55;&#x79CD;&#x5DE5;&#x5177;&#x6C38;&#x8FDC;&#x53EA;&#x53D6;&#x51B3;&#x4E8E;&#x4EFB;&#x52A1;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5DE5;&#x5177;&#x672C;&#x8EAB;&#xFF0C;&#x5F53;&#x4F60;&#x8FD8;&#x5728;&#x7EA0;&#x7ED3;&#x4F7F;&#x7528;&#x4F55;&#x79CD;&#x5DE5;&#x5177;&#x65F6;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x65E9;&#x5C31;&#x5DF2;&#x7ECF;&#x5C06;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E00;&#x4EF6;&#x5DE5;&#x5177;&#x6216;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x6240;&#x4EE5;&#x8FF7;&#x4EBA;&#xFF0C;&#x5E94;&#x8BE5;&#x7F18;&#x81EA;&#x5B83;&#x80FD;&#x9AD8;&#x6548;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x70AB;&#x9177;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x7BA1;&#x7528;&#xFF0C;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x90A3;&#x4E48;&#x53BB;&#x505A;&#x3002;&#x660E;&#x667A;&#x7684;&#x4EBA;&#x529E;&#x4E8B;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x4E0D;&#x62D8;&#x4E00;&#x683C;&#x7684;&#x3002;</p>
<h4 id="&#x754C;&#x9762;&#x56F0;&#x5883;"><a href="#&#x754C;&#x9762;&#x56F0;&#x5883;" class="headerlink" title="&#x754C;&#x9762;&#x56F0;&#x5883;"></a>&#x754C;&#x9762;&#x56F0;&#x5883;</h4><p>&#x754C;&#x9762;&#x662F;&#x4E0D;&#x662F;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x6216;&#x8005;&#x8BF4;&#x754C;&#x9762;&#x5E76;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x5F3A;&#x5927;&#x5C31;&#x8D8A;&#x597D;&#xFF0C;&#x597D;&#x7684;&#x754C;&#x9762;&#x662F;&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#x7684;&#xFF0C;&#x591F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;</p>
<p>&#x5236;&#x4F5C;&#x754C;&#x9762;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x800C;&#x6548;&#x7387;&#x5219;&#x5F80;&#x5F80;&#x4F4E;&#x5F97;&#x60CA;&#x4EBA;&#x3002;&#x7528;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x7BA1;&#x7406;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x8981;&#x628A;&#x4E00;&#x6279;&#x6587;&#x4EF6;&#x4ECE;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4F20;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x754C;&#x9762;&#x7684;&#x8BDD;&#xFF0C;&#x6B65;&#x9AA4;&#x53EF;&#x8C13;&#x7E41;&#x7410;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x5728;&#x4E24;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x901A;&#x8DEF;&#xFF0C;&#x5219;&#x7528;&#x6781;&#x5C11;&#x7684;&#x6B65;&#x9AA4;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x7684;&#x4F20;&#x8F93;&#x4E86;&#x3002;</p>
<p>&#x597D;&#x5728;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x5E76;&#x4E0D;&#x50CF;&#x70ED;&#x8877;&#x5DE5;&#x5177;&#x90A3;&#x4E48;&#x70ED;&#x8877;&#x4E8E;&#x754C;&#x9762;&#xFF0C;&#x2014;&#x2014;&#x4ED6;&#x4EEC;&#x4F1A;&#x5236;&#x4F5C;&#x7E41;&#x590D;&#x800C;&#x7CBE;&#x7F8E;&#x7684;&#x754C;&#x9762;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x53BB;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x5FC3;&#x91CC;&#x90FD;&#x6E05;&#x695A;&#xFF0C;&#x8981;&#x641E;&#x5B9A;&#x4E8B;&#x60C5;&#x8FD8;&#x662F;&#x4E0D;&#x7528;&#x754C;&#x9762;&#x6765;&#x5F97;&#x5FEB;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x5199;&#x4F5C;&#x4E0A;&#xFF0C;&#x518D;&#x5F3A;&#x5927;&#x7684;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x65E0;&#x5916;&#x4E4E;&#x89E3;&#x51B3;&#x4EE5;&#x4E0B;&#x95EE;&#x9898;&#xFF1A;&#x7ED3;&#x6784;&#xFF08;&#x63D0;&#x7EB2;&#x3001;&#x7AE0;&#x8282;&#x7B49;&#xFF09;&#xFF0C;&#x5185;&#x5BB9;&#xFF08;&#x6587;&#x5B57;&#x3001;&#x56FE;&#x5F62;&#x56FE;&#x50CF;&#x3001;&#x58F0;&#x97F3;&#x3001;&#x89C6;&#x9891;&#x7B49;&#xFF09;&#xFF0C;&#x5F15;&#x7528;&#xFF08;&#x4E0E;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#xFF09;&#xFF0C;&#x683C;&#x5F0F;&#xFF08;&#x5B57;&#x4F53;&#x3001;&#x5B57;&#x53F7;&#x3001;&#x989C;&#x8272;&#x3001;&#x8BB0;&#x53F7;&#x7B49;&#xFF09;&#xFF0C;&#x53D1;&#x8868;&#x548C;&#x83B7;&#x5F97;&#x53CD;&#x9988;&#xFF08;&#x8BA9;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x516C;&#x5F00;&#x8BBF;&#x95EE;&#x3001;&#x5206;&#x4EAB;&#x3001;&#x8BC4;&#x8BBA;&#x7B49;&#xFF09;&#x3002;&#x80FD;&#x89E3;&#x51B3;&#x4EE5;&#x4E0A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#x4FBF;&#x662F;&#x5408;&#x683C;&#x7684;&#xFF0C;&#x800C;&#x80FD;&#x7528;&#x6700;&#x9AD8;&#x6548;&#x4FBF;&#x6377;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x5C31;&#x662F;&#x4F18;&#x79C0;&#x7684;&#x4E86;&#x3002;</p>
<h3 id="&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;"><a href="#&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;" class="headerlink" title="&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;"></a>&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;</h3><p>&#x4EE5;&#x4E0A;&#x89C2;&#x70B9;&#x53EF;&#x4EE5;&#x7528;&#x56DB;&#x4E2A;&#x5B57;&#x603B;&#x7ED3;&#xFF1A;&#x80FD;&#x7701;&#x5219;&#x7701;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x540C;&#x6837;&#x9002;&#x7528;&#x5728;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x6BD4;&#x5982;&#x4FE1;&#x606F;&#x7684;&#x6D41;&#x52A8;&#x3002;&#x2014;&#x2014;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x773C;&#x524D;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x53BB;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x5B83;&#x4EEC;&#x3002;&#x4E5F;&#x8BB8;&#x5C06;&#x6765;&#x968F;&#x7740;&#x786C;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x9769;&#x547D;&#xFF0C;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x7684;&#x6210;&#x672C;&#x4E0D;&#x4F1A;&#x4E00;&#x76F4;&#x90A3;&#x4E48;&#x9AD8;&#xFF0C;&#x4F46;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4FE1;&#x606F;&#x91CF;&#x4E5F;&#x4F1A;&#x6210;&#x500D;&#x589E;&#x52A0;&#xFF0C;&#x51CF;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x4F9D;&#x7136;&#x662F;&#x5177;&#x6709;&#x73B0;&#x5B9E;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x73B0;&#x8C61;&#x662F;&#xFF0C;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x63A5;&#x66FF;&#x4E86;&#x539F;&#x6765;&#x5F88;&#x591A;&#x5FC5;&#x987B;&#x7531;&#x670D;&#x52A1;&#x5668;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x754C;&#x9762;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5C11;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x9075;&#x5FAA;&#x51CF;&#x5C11;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x3002;</p>
<p>&#x628A;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x5E94;&#x7528;&#x5230;&#x5199;&#x4F5C;&#x4E0A;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x6807;&#x660E;&#x6587;&#x7AE0;&#x7684;&#x6700;&#x540E;&#x66F4;&#x65B0;&#x65E5;&#x671F;&#xFF0C;&#x5E76;&#x4E14;&#x5C3D;&#x91CF;&#x663E;&#x793A;&#x51FA;&#x672C;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x6837;&#x8BFB;&#x8005;&#x4E0D;&#x5FC5;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x91CD;&#x65B0;&#x9605;&#x8BFB;&#x4F60;&#x7684;&#x6587;&#x7AE0;&#x5C31;&#x80FD;&#x628A;&#x63E1;&#x65B0;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<br>

<p>&#x6700;&#x540E;&#x56DE;&#x7B54;&#x6807;&#x9898;&#x4E2D;&#x7684;&#x90A3;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x4F55;&#x50CF;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x6837;&#x5199;&#x4F5C;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5199;&#x4F5C;&#x98CE;&#x683C;&#x4E00;&#x5B9A;&#x662F;&#x7CBE;&#x7B80;&#x5E76;&#x4E14;&#x903B;&#x8F91;&#x4E25;&#x8C28;&#x7684;&#xFF0C;&#x8FDE;&#x7BC7;&#x7D2F;&#x724D;&#x5374;&#x8A00;&#x4E4B;&#x65E0;&#x7269;&#x7684;&#x6587;&#x7AE0;&#x7EDD;&#x5BF9;&#x662F;&#x4E0E;&#x7A0B;&#x5E8F;&#x5458;&#x98CE;&#x683C;&#x80CC;&#x9053;&#x800C;&#x9A70;&#x7684;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5728;&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;&#x4E0A;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4E0D;&#x62D8;&#x4E00;&#x683C;&#xFF0C;&#x9AD8;&#x6548;&#x662F;&#x552F;&#x4E00;&#x7684;&#x9009;&#x62E9;&#x6807;&#x51C6;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4F5C;&#x8005;&#x548C;&#x8BFB;&#x8005;&#x7684;&#x6548;&#x7387;&#x6700;&#x4F18;&#x5316;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x51CF;&#x5C11;&#x751A;&#x81F3;&#x675C;&#x7EDD;&#x65E0;&#x8C13;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x3002;</p>
<h3 id="&#x9A6C;&#x4E0A;&#x5C31;&#x5F00;&#x59CB;"><a href="#&#x9A6C;&#x4E0A;&#x5C31;&#x5F00;&#x59CB;" class="headerlink" title="&#x9A6C;&#x4E0A;&#x5C31;&#x5F00;&#x59CB;"></a>&#x9A6C;&#x4E0A;&#x5C31;&#x5F00;&#x59CB;</h3><p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x56DB;&#x4E2A;&#x5B57;&#xFF1A;&#x5185;&#x5BB9;&#x4E3A;&#x738B;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x628A;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x5185;&#x5BB9;&#x7684;&#x521B;&#x4F5C;&#x4E0A;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x7528;&#x5927;&#x7EA6;&#x5341;&#x5206;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x642D;&#x5EFA;&#x597D;&#x4E86;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x754C;&#x9762;&#xFF0C;&#x800C;&#x53EA;&#x7528;&#x6700;&#x5FEB;&#x6377;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;&#x5982;vi&#x6216;emacs&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E86;Markdown&#x4F5C;&#x4E3A;&#x683C;&#x5F0F;&#x5316;&#x8BED;&#x8A00;&#xFF0C;&#x5373;&#x4FBF;&#x8FD9;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5F88;&#x76F4;&#x89C2;&#x5730;&#x7F16;&#x8F91;&#xFF0C;&#x800C;&#x4E14;&#x9664;&#x975E;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x91CD;&#x590D;&#x53D1;&#x5E03;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;Hexo&#x4F5C;&#x4E3A;&#x5DE5;&#x5177;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/24/su-min-ji/" itemprop="url">宿民记</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-23T18:29:33.000Z" itemprop="datePublished">8月 24 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/life/">生活</a><span>></span><a class="article-category-link" href="/categories/story/">故事</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            26 分钟 读完 (约 3840 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><blockquote>
<p><small>&#x672C;&#x6587;&#x6700;&#x65E9;&#x53D1;&#x5E03;&#x4E8E;2018&#x5E74;11&#x6708;2&#x65E5;&#x7684;&#x540C;&#x540D;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x4E0A;&#x3002;</small></p>
</blockquote>
<p>&#x6211;&#x5BB6;&#x6709;&#x95F4;&#x5E38;&#x5E74;&#x95F2;&#x7F6E;&#x7684;&#x5BA2;&#x623F;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x5E74;&#x7F51;&#x4E0A;&#x6C11;&#x5BBF;&#x751F;&#x610F;&#x65B9;&#x5174;&#x672A;&#x827E;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x4F55;&#x4E0D;&#x628A;&#x5B83;&#x597D;&#x597D;&#x5E03;&#x7F6E;&#x4E00;&#x4E0B;&#x505A;&#x6210;&#x6C11;&#x5BBF;&#x6302;&#x5230;&#x7F51;&#x4E0A;&#xFF1F;&#x4E00;&#x6765;&#x53EF;&#x4EE5;&#x63A5;&#x5F85;&#x56DB;&#x65B9;&#x5BBE;&#x670B;&#xFF0C;&#x4E8C;&#x6765;&#x8FD8;&#x80FD;&#x987A;&#x4FBF;&#x8D5A;&#x70B9;&#x96F6;&#x82B1;&#x94B1;&#xFF0C;&#x771F;&#x662F;&#x4E24;&#x5168;&#x5176;&#x7F8E;&#xFF01;</p>
<p>&#x7406;&#x60F3;&#x5F88;&#x4E30;&#x6EE1;&#xFF0C;&#x73B0;&#x5B9E;&#x5F88;&#x9AA8;&#x611F;&#x3002;</p></body></html>
        <p class="article-more-link">
            <a href="/2020/08/24/su-min-ji/#more">阅读更多</a>
        </p>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/" itemprop="url">禅与摩托车维修艺术</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-21T19:59:33.000Z" itemprop="datePublished">8月 22 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/book/">读书</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            4 分钟 读完 (约 537 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><img src="/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/shutterstock_18369445777.jpg" class title="Zen and the Art of Motorcycle Maintenance">

<blockquote><p>&#x8FC7;&#x53BB;&#x4E24;&#x4E2A;&#x6708;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x8BFB;&#x8FD9;&#x672C;400&#x9875;&#x7684;&#x4E66;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4ECA;&#x5E74;&#x8BFB;&#x8FC7;&#x7684;&#x6700;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x597D;&#x4E66;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x5B83;&#x5F88;&#x72EC;&#x7279;&#xFF0C;&#x4E00;&#x534A;&#x662F;&#x6E38;&#x8BB0;&#xFF0C;&#x8BB2;&#x8FF0;&#x4F5C;&#x8005;&#x4E0E;&#x513F;&#x5B50;&#x7684;&#x4E00;&#x6B21;&#x6469;&#x6258;&#x8F66;&#x65C5;&#x884C;&#xFF0C;&#x4ECE;&#x660E;&#x5C3C;&#x82CF;&#x8FBE;&#x5DDE;&#x4E00;&#x76F4;&#x5230;&#x52A0;&#x5DDE;&#xFF0C;&#x8017;&#x65F6;17&#x5929;&#xFF1B;&#x53E6;&#x4E00;&#x534A;&#x662F;&#x54F2;&#x5B66;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F5C;&#x8005;&#x5256;&#x6790;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5BFB;&#x6C42;&#x5FC3;&#x7075;&#x7684;&#x7B54;&#x6848;&#x3002;&#x4E24;&#x79CD;&#x6587;&#x4F53;&#x4EA4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x79F0;&#x5B83;&#x4E3A;&#x201D;&#x54F2;&#x5B66;&#x5C0F;&#x8BF4;&#x201D;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x6CE2;&#x897F;&#x683C;&#xFF08;1928-&#xFF0C;Robert M. Pirsig&#xFF09;&#x5927;&#x5B66;&#x65F6;&#x4E3B;&#x4FEE;&#x751F;&#x7269;&#x5316;&#x5B66;&#xFF0C;&#x540E;&#x6765;&#x5BF9;&#x54F2;&#x5B66;&#x4EA7;&#x751F;&#x5174;&#x8DA3;&#xFF0C;1950&#x5E74;&#x524D;&#x5F80;&#x5370;&#x5EA6;&#x5B66;&#x4E60;&#x4E1C;&#x65B9;&#x54F2;&#x5B66;&#x3002;&#x56DE;&#x56FD;&#x540E;&#xFF0C;&#x5728;&#x5F53;&#x5730;&#x5927;&#x5B66;&#x62C5;&#x4EFB;&#x5199;&#x4F5C;&#x8BFE;&#x6559;&#x5E08;&#x3002;1961&#x5E74;&#xFF0C;&#x4ED6;&#x88AB;&#x8BCA;&#x65AD;&#x4E3A;&#x504F;&#x6267;&#x578B;&#x7CBE;&#x795E;&#x5206;&#x88C2;&#x75C7;&#x548C;&#x4E34;&#x5E8A;&#x5FE7;&#x90C1;&#x75C7;&#xFF0C;&#x88AB;&#x591A;&#x6B21;&#x9001;&#x8FDB;&#x7CBE;&#x795E;&#x75C5;&#x9662;&#xFF0C;&#x63A5;&#x53D7;&#x8FC7;28&#x6B21;&#x7535;&#x51FB;&#x7597;&#x6CD5;&#x3002;</p>
<p>1968&#x5E74;&#x51FA;&#x9662;&#x540E;&#xFF0C;&#x4ED6;&#x5E26;&#x7740;10&#x5C81;&#x7684;&#x513F;&#x5B50;&#x514B;&#x91CC;&#x65AF;&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x957F;&#x9014;&#x6469;&#x6258;&#x8F66;&#x65C5;&#x884C;&#x3002;&#x4ED6;&#x628A;&#x65C5;&#x884C;&#x7684;&#x611F;&#x53D7;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x5199;&#x6210;&#x4E86;&#x4E00;&#x672C;&#x4E66;&#x300A;&#x7985;&#x4E0E;&#x6469;&#x6258;&#x8F66;&#x7EF4;&#x4FEE;&#x827A;&#x672F;&#x300B;&#xFF08;Zen and the Art of Motorcycle Maintenance&#xFF09;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FDE;&#x7EED;&#x88AB;121&#x5BB6;&#x51FA;&#x7248;&#x793E;&#x62D2;&#x7EDD;&#xFF0C;&#x76F4;&#x5230;1974&#x5E74;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x624D;&#x51FA;&#x7248;&#x3002;&#x4F46;&#x662F;&#x51FA;&#x7248;&#x540E;&#xFF0C;&#x9500;&#x552E;&#x91CF;&#x60CA;&#x4EBA;&#xFF0C;&#x8D85;&#x8FC7;500&#x4E07;&#x518C;&#xFF0C;&#x6210;&#x4E3A;70&#x5E74;&#x4EE3;&#x7F8E;&#x56FD;&#x5341;&#x5927;&#x7545;&#x9500;&#x4E66;&#x4E4B;&#x4E00;&#xFF0C;&#x76EE;&#x524D;&#x7D2F;&#x8BA1;&#x9500;&#x552E;&#x91CF;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;1000&#x4E07;&#x518C;&#x3002;&#x300A;&#x5409;&#x5C3C;&#x65AF;&#x4E16;&#x754C;&#x7EAA;&#x5F55;&#x300B;&#x79F0;&#x5B83;&#x662F;&#x201D;&#x4E16;&#x754C;&#x4E0A;&#x88AB;&#x62D2;&#x7A3F;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x7545;&#x9500;&#x4E66;&#x201D;&#x3002;</p>
<p>&#x6B64;&#x4E66;&#x5728;&#x56FD;&#x5185;&#x6709;&#x4E24;&#x4E2A;&#x4E2D;&#x6587;&#x7248;&#xFF1A;&#x300A;&#x7236;&#x5B50;&#x7684;&#x4E16;&#x754C;&#x300B;&#xFF08;&#x4E2D;&#x56FD;&#x53CB;&#x8C0A;&#x51FA;&#x7248;&#x516C;&#x53F8;&#xFF0C;&#x9EC4;&#x6B23;&#x8BD1;&#xFF0C;1999&#xFF09;&#x548C;&#x300A;&#x4E07;&#x91CC;&#x4EFB;&#x7985;&#x6E38;&#x300B;&#xFF08;&#x91CD;&#x5E86;&#x51FA;&#x7248;&#x793E;&#xFF0C;&#x5F20;&#x56FD;&#x8FB0;&#x8BD1;&#xFF0C;2006&#xFF09;&#x3002;&#x540E;&#x9762;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x4ECA;&#x5E74;9&#x6708;&#x5DF2;&#x7ECF;&#x518D;&#x7248;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x7EC8;&#x4E8E;&#x5C06;&#x4E66;&#x540D;&#x6539;&#x6210;&#x539F;&#x540D;&#x4E86;&#x3002;&#x7F51;&#x4E0A;&#x6709;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x7FFB;&#x8BD1;&#x5F97;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x3002;</p>
<footer><strong>&#x962E;&#x4E00;&#x5CF0;</strong><cite><a target="_blank" rel="noopener" href="http://www.ruanyifeng.com/blog/2011/12/zen_and_the_art_of_motorcycle_maintenance.html">&#x300A;&#x7985;&#x4E0E;&#x6469;&#x6258;&#x8F66;&#x7EF4;&#x4FEE;&#x827A;&#x672F;&#x300B;&#x8BFB;&#x540E;&#x611F;</a></cite></footer></blockquote></body></html>
    
    </div>
    
    
</article>




    
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2021 胡芍&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    
<script src="/js/jquery.js"></script>


<script src="/js/moment-with-locales.js"></script>


<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>

<script src="/js/outdatedbrowser.js"></script>

<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>




<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>