<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>宿民记 - 只是胡闹</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">







<link rel="alternative" href="/atom.xml" title="宿民记" type="application/atom+xml">




<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>



<meta name="generator" content="Hexo 5.0.2"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/life">生活</a>
            
            <a class="navbar-item "
               href="/categories/book">读书</a>
            
            <a class="navbar-item "
               href="/categories/music">爱乐</a>
            
            <a class="navbar-item "
               href="/categories/art">品画</a>
            
            <a class="navbar-item "
               href="/categories/movie">观影</a>
            
            <a class="navbar-item "
               href="/categories/technology">探技</a>
            
            <a class="navbar-item "
               href="/categories/story">故事</a>
            
            <a class="navbar-item "
               href="/archives">所有文章</a>
            
            <a class="navbar-item "
               href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/ppoffice/hexo-theme-minos">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            宿民记
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-08-23T18:29:33.000Z" itemprop="datePublished">8月 24 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/life/">生活</a><span>></span><a class="article-category-link" href="/categories/story/">故事</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            26 分钟 读完 (约 3847 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><blockquote>
<p><small>&#x6309;&#xFF1A;&#x672C;&#x6587;&#x6700;&#x65E9;&#x53D1;&#x5E03;&#x4E8E;2018&#x5E74;11&#x6708;2&#x65E5;&#x7684;&#x540C;&#x540D;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x4E0A;&#xFF0C;&#x7CFB;&#x65E7;&#x6587;&#x91CD;&#x53D1;&#x3002;</small></p>
</blockquote>
<p>&#x6211;&#x5BB6;&#x6709;&#x95F4;&#x5E38;&#x5E74;&#x95F2;&#x7F6E;&#x7684;&#x5BA2;&#x623F;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x5E74;&#x7F51;&#x4E0A;&#x6C11;&#x5BBF;&#x751F;&#x610F;&#x65B9;&#x5174;&#x672A;&#x827E;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x4F55;&#x4E0D;&#x628A;&#x5B83;&#x597D;&#x597D;&#x5E03;&#x7F6E;&#x4E00;&#x4E0B;&#x505A;&#x6210;&#x6C11;&#x5BBF;&#x6302;&#x5230;&#x7F51;&#x4E0A;&#xFF1F;&#x4E00;&#x6765;&#x53EF;&#x4EE5;&#x63A5;&#x5F85;&#x56DB;&#x65B9;&#x5BBE;&#x670B;&#xFF0C;&#x4E8C;&#x6765;&#x8FD8;&#x80FD;&#x987A;&#x4FBF;&#x8D5A;&#x70B9;&#x96F6;&#x82B1;&#x94B1;&#xFF0C;&#x771F;&#x662F;&#x4E24;&#x5168;&#x5176;&#x7F8E;&#xFF01;</p>
<p>&#x7406;&#x60F3;&#x5F88;&#x4E30;&#x6EE1;&#xFF0C;&#x73B0;&#x5B9E;&#x5F88;&#x9AA8;&#x611F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x8981;&#x5728;&#x6C11;&#x5BBF;&#x5E73;&#x53F0;&#x4E0A;&#x6302;&#x51FA;&#x4E00;&#x5957;&#x623F;&#x6E90;&#x7684;&#x7E41;&#x7410;&#x6B65;&#x9AA4;&#x5C31;&#x591A;&#x6B21;&#x8BA9;&#x6211;&#x671B;&#x800C;&#x5374;&#x6B65;&#xFF0C;&#x5149;&#x662F;&#x5199;&#x51FA;&#x65E2;&#x8BF1;&#x4EBA;&#x3001;&#x53C8;&#x4E0D;&#x5938;&#x5927;&#x5176;&#x8BCD;&#x7684;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E00;&#x6761;&#x5C31;&#x8DB3;&#x591F;&#x628A;&#x6211;&#x903C;&#x75AF;&#x4E86;&#x3002;&#x6211;&#x7684;&#x5BB6;&#xFF0C;&#x9664;&#x53BB;&#x6211;&#x4E3B;&#x89C2;&#x4E0A;&#x7ED9;&#x5B83;&#x8D4B;&#x4E88;&#x7684;&#x4E9B;&#x8BB8;&#x6587;&#x827A;&#x6C14;&#x606F;&#x4E4B;&#x5916;&#xFF0C;&#x5BA2;&#x89C2;&#x4E0A;&#x5B9E;&#x5728;&#x662F;&#x4E4F;&#x5584;&#x53EF;&#x9648;&#x3002;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x8FFD;&#x6C42;&#x6781;&#x7B80;&#x751F;&#x6D3B;&#x4F5C;&#x98CE;&#x7684;&#x4EBA;&#xFF0C;&#x5BB6;&#x91CC;&#x9664;&#x4E86;&#x5E72;&#x51C0;&#x3001;&#x6574;&#x6D01;&#xFF0C;&#x6BCF;&#x4EF6;&#x7269;&#x54C1;&#x90FD;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x4E4B;&#x5916;&#xFF0C;&#x5C31;&#x771F;&#x7684;&#x627E;&#x4E0D;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x4F18;&#x70B9;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x5468;&#x8FB9;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x5546;&#x4E1A;&#x548C;&#x666F;&#x70B9;&#xFF0C;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x5730;&#x94C1;&#x8981;&#x5341;&#x591A;&#x5206;&#x949F;&#xFF0C;&#x552F;&#x4E00;&#x53EF;&#x4EE5;&#x5439;&#x5618;&#x7684;&#x662F;&#x8FD9;&#x91CC;&#x771F;&#x7684;&#x6709;&#x5BB6;&#x4E0D;&#x9519;&#x7684;&#x533B;&#x9662;&#x3002;</p>
<p>&#x6211;&#x7684;&#x5F3A;&#x8FEB;&#x75C7;&#x51B3;&#x5B9A;&#x4E86;&#x53EA;&#x8981;&#x662F;&#x6211;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x603B;&#x6709;&#x529E;&#x6CD5;&#x505A;&#x5230;&#x3002;&#x5199;&#x4ECB;&#x7ECD;&#xFF0C;&#x8003;&#x9A8C;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6211;&#x7684;&#x6587;&#x5B57;&#x529F;&#x529B;&#xFF0C;&#x66F4;&#x50CF;&#x662F;&#x5728;&#x8003;&#x9A8C;&#x6211;&#x5728;&#x9648;&#x8FF0;&#x4E8B;&#x5B9E;&#x548C;&#x7C89;&#x9970;&#x592A;&#x5E73;&#x4E4B;&#x95F4;&#x5BFB;&#x627E;&#x5E73;&#x8861;&#x7684;&#x80FD;&#x529B;&#xFF1B;&#x6DFB;&#x7F6E;&#x6C11;&#x5BBF;&#x7684;&#x5FC5;&#x9700;&#x54C1;&#xFF0C;&#x8BA9;&#x6211;&#x4E00;&#x6B21;&#x6B21;&#x5728;&#x7B97;&#x7ECF;&#x6D4E;&#x8D26;&#xFF0C;&#x8981;&#x628A;&#x6BCF;&#x665A;&#x4EF7;&#x683C;&#x5B9A;&#x5230;&#x591A;&#x5C11;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x5185;&#x628A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x4EF7;&#x503C;&#x8D5A;&#x56DE;&#x6765;&#xFF1B;&#x6700;&#x540E;&#x62CD;&#x7167;&#x7247;&#xFF0C;&#x8FD8;&#x5DEE;&#x70B9;&#x8BA9;&#x6211;&#x8DCC;&#x8FDB;&#x4E86;&#x6444;&#x5F71;&#x53D1;&#x70E7;&#x53CB;&#x7684;&#x5751;&#x91CC;&#x3002;</p>
<p>&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x7B14;&#x8BA2;&#x5355;&#x662F;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x5348;&#x540E;&#x5F53;&#x6211;&#x6B63;&#x51C6;&#x5907;&#x4EAB;&#x53D7;&#x4E00;&#x676F;&#x89E3;&#x4E4F;&#x7684;&#x5496;&#x5561;&#x7684;&#x65F6;&#x5019;&#x3002;&#x5BA2;&#x4EBA;&#x662F;&#x4E2A;&#x6587;&#x8D28;&#x5F6C;&#x5F6C;&#x7684;&#x5C0F;&#x4F19;&#x5B50;&#xFF0C;&#x5404;&#x65B9;&#x9762;&#x90FD;&#x65E0;&#x53EF;&#x6311;&#x5254;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5403;&#x4E86;&#x65E9;&#x9910;&#xFF0C;&#x6211;&#x62FF;&#x51FA;&#x7B14;&#x548C;&#x4E00;&#x53E0;&#x5F69;&#x8272;&#x7684;&#x4FBF;&#x7B7E;&#x7EB8;&#xFF0C;&#x8BF7;&#x4ED6;&#x4E3A;&#x6211;&#x5199;&#x4E0B;&#x4E86;&#x7B2C;&#x4E00;&#x6761;&#x8BC4;&#x8BED;&#x3002;&#x77ED;&#x77ED;&#x7684;&#x51E0;&#x5341;&#x4E2A;&#x5B57;&#xFF0C;&#x6D0B;&#x6EA2;&#x7740;&#x5404;&#x79CD;&#x771F;&#x8BDA;&#x7684;&#x8D5E;&#x626C;&#x8BDD;&#x8BED;&#x3002;&#x8FD9;&#x6B21;&#x5C0F;&#x5C0F;&#x7684;&#x5F00;&#x95E8;&#x7EA2;&#x6781;&#x5927;&#x5730;&#x9F13;&#x821E;&#x4E86;&#x6211;&#x60F3;&#x628A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7EE7;&#x7EED;&#x505A;&#x4E0B;&#x53BB;&#x7684;&#x4FE1;&#x5FC3;&#x3002;</p>
<p>&#x540E;&#x9762;&#x7684;&#x6545;&#x4E8B;&#x5C31;&#x592A;&#x591A;&#x592A;&#x591A;&#x4E86;&#xFF1A;&#x6709;&#x538C;&#x5026;&#x4E86;&#x5728;&#x9999;&#x6E2F;&#x5E38;&#x5E74;&#x4F4F;&#x9152;&#x5E97;&#x800C;&#x4E00;&#x9047;&#x51FA;&#x5DEE;&#x5C31;&#x504F;&#x7231;&#x627E;&#x5BB6;&#x5EAD;&#x6C11;&#x5BBF;&#x7684;&#x91D1;&#x878D;&#x5C4A;&#x7CBE;&#x82F1;&#xFF0C;&#x4E5F;&#x6709;&#x65E5;&#x672C;&#x5B66;&#x6210;&#x56DE;&#x56FD;&#x5728;&#x6BCD;&#x4EB2;&#x7684;&#x966A;&#x540C;&#x4E0B;&#x6765;&#x4E0A;&#x6D77;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x6F2B;&#x753B;&#x5C11;&#x5973;&#xFF0C;&#x6709;&#x6BD5;&#x4E1A;&#x540E;&#x5404;&#x5954;&#x4E1C;&#x897F;&#x800C;&#x601D;&#x5FF5;&#x91CD;&#x805A;&#x7684;&#x95FA;&#x871C;&#xFF0C;&#x4E5F;&#x6709;&#x56E0;&#x4E3A;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x8981;&#x51FA;&#x6765;&#x4EAB;&#x53D7;&#x4E00;&#x591C;&#x6625;&#x5BB5;&#x7684;&#x60C5;&#x4FA3;&#x2026;&#x2026;&#x6211;&#x6709;&#x5FC3;&#x8BB0;&#x4E0B;&#x4E0E;&#x4ED6;&#x4EEC;&#x6BCF;&#x4E00;&#x4F4D;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x53EA;&#x6015;&#x8BFB;&#x8005;&#x6CA1;&#x6709;&#x8010;&#x5FC3;&#x7EE7;&#x7EED;&#x8BFB;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x3002;&#x597D;&#x5728;&#x8BA9;&#x6211;&#x6B23;&#x6170;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6765;&#x53BB;&#x5306;&#x5306;&#x7684;&#x5BA2;&#x4EBA;&#x867D;&#x7136;&#x90FD;&#x4E0D;&#x5C3D;&#x5B8C;&#x7F8E;&#xFF0C;&#x5374;&#x5404;&#x6709;&#x5404;&#x7684;&#x53EF;&#x7231;&#x4E4B;&#x5904;&#xFF0C;&#x7ED9;&#x6211;&#x7559;&#x4E0B;&#x7684;&#x9664;&#x4E86;&#x623F;&#x8D39;&#xFF0C;&#x8FD8;&#x6709;&#x8FD1;&#x767E;&#x6761;&#x6E05;&#x4E00;&#x8272;&#x7684;&#x597D;&#x8BC4;&#x3002;&#x6BCF;&#x6B21;&#x5F53;&#x6211;&#x770B;&#x7740;&#x5BB6;&#x91CC;&#x90A3;&#x9762;&#x65E5;&#x6E10;&#x53D8;&#x5F97;&#x8272;&#x5F69;&#x6591;&#x6593;&#x7684;&#x7559;&#x8A00;&#x5899;&#x65F6;&#xFF0C;&#x5FC3;&#x4E2D;&#x603B;&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x4E0D;&#x51FA;&#x7684;&#x6EE1;&#x8DB3;&#x611F;&#x3002;</p>
<p>&#x6211;&#x5F88;&#x5C11;&#x63A5;&#x5F85;&#x957F;&#x4F4F;&#x7684;&#x5BA2;&#x4EBA;&#xFF0C;&#x6700;&#x957F;&#x4E0D;&#x8D85;&#x8FC7;&#x4E00;&#x5468;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7ED9;&#x6211;&#x7684;&#x7F51;&#x4E0A;&#x623F;&#x6E90;&#x8BBE;&#x5B9A;&#x7684;&#x5165;&#x4F4F;&#x89C4;&#x5219;&#x3002;&#x4F46;&#x4E5F;&#x6709;&#x4F8B;&#x5916;&#xFF0C;&#x5176;&#x95F4;&#x5C31;&#x66FE;&#x6709;&#x8FC7;&#x4E00;&#x4F4D;&#x793E;&#x4F1A;&#x5B66;&#x5973;&#x535A;&#x58EB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E1A;&#x539F;&#x56E0;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x51FA;&#x6CA1;&#x4E8E;&#x9644;&#x8FD1;&#x9AD8;&#x6821;&#x7684;&#x56FE;&#x4E66;&#x9986;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5012;&#x662F;&#x5F88;&#x60F3;&#x7559;&#x5979;&#x5E38;&#x4F4F;&#x7684;&#xFF0C;&#x53EF;&#x60DC;&#x5979;&#x5728;&#x6211;&#x58F0;&#x60C5;&#x5E76;&#x8302;&#x5730;&#x6F14;&#x793A;&#x5B8C;&#x6211;&#x5BB6;&#x7684;&#x79CD;&#x79CD;&#x6E29;&#x99A8;&#x8212;&#x9002;&#x4E4B;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x4E86;&#x53E6;&#x4E00;&#x5904;&#x4F4F;&#x6240;&#xFF0C;&#x7406;&#x7531;&#x662F;&#x5979;&#x53BB;&#x5B66;&#x6821;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x4E94;&#x5206;&#x949F;&#x7684;&#x8DEF;&#x7A0B;&#x3002;&#x4E4B;&#x540E;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x54A8;&#x8BE2;&#x60F3;&#x8981;&#x957F;&#x4F4F;&#x7684;&#x5BA2;&#x4EBA;&#xFF0C;&#x90FD;&#x88AB;&#x6211;&#x4E00;&#x5E76;&#x56DE;&#x7EDD;&#x4E86;&#x2014;&#x2014;&#x6211;&#x5F88;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x60F3;&#x8981;&#x627E;&#x7684;&#x662F;&#x5BA2;&#x4EBA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BA4;&#x53CB;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;</p>
<p>&#x4E0A;&#x4E2A;&#x6708;&#x6211;&#x6B63;&#x597D;&#x9700;&#x8981;&#x51FA;&#x56FD;&#x534A;&#x4E2A;&#x6708;&#xFF0C;&#x53EF;&#x5DE7;&#x7684;&#x662F;&#xFF0C;&#x6B63;&#x597D;&#x8FD9;&#x65F6;&#x6709;&#x4F4D;&#x5BA2;&#x4EBA;&#x54A8;&#x8BE2;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x957F;&#x4F4F;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x5BB6;&#x6700;&#x8FD1;&#x5728;&#x88C5;&#x4FEE;&#xFF0C;&#x65F6;&#x95F4;&#x5927;&#x7EA6;&#x4E3A;20&#x5929;&#xFF0C;&#x800C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x6B63;&#x597D;&#x662F;&#x6211;&#x5728;&#x56FD;&#x5916;&#x7684;&#x65F6;&#x5019;&#x3002;&#x4ED6;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x5165;&#x4F4F;&#x65F6;&#x95F4;&#x662F;&#x5728;&#x6211;&#x51FA;&#x56FD;&#x4E4B;&#x524D;&#xFF0C;&#x800C;&#x9000;&#x623F;&#x65F6;&#x95F4;&#x662F;&#x5728;&#x6211;&#x56DE;&#x56FD;&#x4E4B;&#x540E;&#xFF0C;&#x5B8C;&#x7F8E;&#x5730;&#x586B;&#x8865;&#x4E86;&#x6211;&#x6C11;&#x5BBF;&#x7684;&#x7A7A;&#x6863;&#x3002;&#x6B63;&#x5F0F;&#x4EA4;&#x6613;&#x524D;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x4E86;&#x77ED;&#x6682;&#x7684;&#x4F1A;&#x9762;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x53CC;&#x65B9;&#x90FD;&#x662F;&#x53EF;&#x9760;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x662F;&#x4E00;&#x5BF9;&#x65B0;&#x5A5A;&#x592B;&#x5987;&#xFF0C;&#x5973;&#x5B69;&#x4E2A;&#x5B50;&#x4E0D;&#x9AD8;&#xFF0C;&#x8FD8;&#x6709;&#x70B9;&#x9A7C;&#x80CC;&#xFF0C;&#x7559;&#x4E00;&#x5934;&#x5218;&#x80E1;&#x5170;&#x4F3C;&#x7684;&#x53D1;&#x578B;&#xFF0C;&#x80FD;&#x8A00;&#x4F1A;&#x9053;&#xFF0C;&#x4E00;&#x8BF4;&#x8BDD;&#x5C31;&#x9732;&#x51FA;&#x6EE1;&#x5634;&#x7684;&#x7259;&#x5957;&#x3002;&#x7537;&#x5B69;&#x5012;&#x662F;&#x9AD8;&#x5927;&#x5E05;&#x6C14;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4E9B;&#x817C;&#x8146;&#xFF0C;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x5F88;&#x5C11;&#x8BF4;&#x8BDD;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x4F1A;&#x4ECB;&#x610F;&#x6211;&#x4EEC;&#x5E26;&#x4E24;&#x53EA;&#x732B;&#x4E00;&#x8D77;&#x6765;&#x4F4F;&#x5417;&#xFF1F;&#x201D;&#x5973;&#x5B69;&#x95EE;&#x3002;</p>
<p>&#x201C;&#x8FD9;&#x4E2A;&#x2026;&#x2026;&#x201D;&#x6211;&#x9762;&#x9732;&#x96BE;&#x8272;&#x3002;&#x201C;&#x53EF;&#x80FD;&#x6709;&#x70B9;&#x4ECB;&#x610F;&#x54E6;&#x3002;&#x6211;&#x5F88;&#x559C;&#x6B22;&#x5BA0;&#x7269;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x732B;&#xFF0C;&#x4F46;&#x6211;&#x672C;&#x4EBA;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x517B;&#x732B;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x5BB6;&#x8FD9;&#x4E48;&#x591A;&#x82B1;&#x8349;&#x3001;&#x5E03;&#x827A;&#x548C;&#x5C0F;&#x6446;&#x8BBE;&#xFF0C;&#x4E5F;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x517B;&#x732B;&#x7684;&#x3002;&#x201D;</p>
<p>&#x201C;&#x54E6;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F60;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#xFF0C;&#x732B;&#x4F1A;&#x5173;&#x5728;&#x7B3C;&#x5B50;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x653E;&#x5B83;&#x4EEC;&#x51FA;&#x6765;&#x7684;&#x3002;&#x201D;</p>
<p>&#x201C;&#x597D;&#x5427;&#x2026;&#x2026;&#x201D;&#x7B54;&#x5E94;&#x5B8C;&#x4ED6;&#x4EEC;&#x4E4B;&#x540E;&#x6211;&#x5F00;&#x59CB;&#x6781;&#x5176;&#x5FC3;&#x75BC;&#x8D77;&#x90A3;&#x4E24;&#x53EA;&#x53EF;&#x601C;&#x7684;&#x732B;&#x6765;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x5728;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#x4F4F;&#x8FDB;&#x4E86;&#x6211;&#x5BB6;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#x4E0A;&#x5348;&#x6211;&#x53C8;&#x89C1;&#x5230;&#x4E86;&#x90A3;&#x5973;&#x5B69;&#xFF0C;&#x5979;&#x5F88;&#x70ED;&#x60C5;&#x5730;&#x8DDF;&#x6211;&#x6253;&#x62DB;&#x547C;&#xFF0C;&#x6211;&#x4E5F;&#x8DDF;&#x5979;&#x6500;&#x8C08;&#x8D77;&#x6765;&#x3002;&#x636E;&#x5979;&#x8BF4;&#x5979;&#x662F;&#x505A;&#x91D1;&#x878D;&#x884C;&#x4E1A;&#x7684;&#xFF0C;&#x662F;&#x4E2A;&#x5927;&#x5FD9;&#x4EBA;&#xFF0C;&#x5E73;&#x65F6;&#x5230;&#x5904;&#x51FA;&#x5DEE;&#xFF0C;&#x5F88;&#x5C11;&#x5728;&#x5BB6;&#xFF1B;&#x5979;&#x8001;&#x516C;&#x4E5F;&#x662F;&#x4E0A;&#x73ED;&#x65CF;&#xFF0C;&#x6BCF;&#x5929;&#x65E9;&#x51FA;&#x665A;&#x5F52;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x6697;&#x81EA;&#x6B22;&#x559C;&#x3002;&#x6700;&#x540E;&#x6211;&#x63D0;&#x5230;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x732B;&#xFF0C;&#x5979;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x8BDD;&#x9898;&#xFF0C;&#x4EE5;&#x98DE;&#x4E00;&#x822C;&#x7684;&#x901F;&#x5EA6;&#x8F6C;&#x8EAB;&#x8FDB;&#x5C4B;&#x53BB;&#x62B1;&#x4E86;&#x4E00;&#x53EA;&#x51FA;&#x6765;&#x3002;&#x51FA;&#x73B0;&#x5728;&#x6211;&#x773C;&#x524D;&#x7684;&#x662F;&#x4E00;&#x53EA;&#x6BDB;&#x8272;&#x9ED1;&#x767D;&#x76F8;&#x95F4;&#x7684;&#x5C0F;&#x82B1;&#x732B;&#xFF0C;&#x4E56;&#x4E56;&#x5730;&#x8737;&#x7F29;&#x5728;&#x4E3B;&#x4EBA;&#x6000;&#x91CC;&#xFF0C;&#x5E72;&#x51C0;&#x53C8;&#x53EF;&#x601C;&#x3002;</p>
<p>&#x201C;&#x732B;&#x5E73;&#x65F6;&#x4F1A;&#x5728;&#x7B3C;&#x5B50;&#x91CC;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4E56;&#x53EF;&#x4E56;&#x4E86;&#x3002;&#x4F60;&#x770B;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5C31;&#x628A;&#x5B83;&#x4EEC;&#x62B1;&#x56DE;&#x53BB;&#x3002;&#x201D;&#x8BF4;&#x7740;&#x5979;&#x53C8;&#x8F6C;&#x8EAB;&#x8FDB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x95F4;&#x3002;</p>
<p>&#x6211;&#x7684;&#x822A;&#x73ED;&#x662F;&#x7B2C;&#x4E09;&#x5929;&#x7684;&#x4E2D;&#x5348;&#xFF0C;&#x4E34;&#x8D70;&#x524D;&#x6211;&#x628A;&#x5BA2;&#x5385;&#x9633;&#x53F0;&#x53A8;&#x623F;&#x536B;&#x751F;&#x95F4;&#x6240;&#x6709;&#x516C;&#x5171;&#x7A7A;&#x95F4;&#x90FD;&#x518D;&#x6B21;&#x6253;&#x626B;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5F00;&#x59CB;&#x53D1;&#x73B0;&#x5230;&#x5904;&#x90FD;&#x6709;&#x732B;&#x6BDB;&#x548C;&#x732B;&#x811A;&#x5370;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x7A00;&#x7A00;&#x62C9;&#x62C9;&#x7684;&#x732B;&#x7802;&#xFF0C;&#x6700;&#x8BA9;&#x6211;&#x5FC3;&#x75BC;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x4E00;&#x76C6;&#x690D;&#x7269;&#x6574;&#x4E2A;&#x4ECE;&#x67B6;&#x5B50;&#x4E0A;&#x7FFB;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x5730;&#x4E0A;&#x90FD;&#x662F;&#x571F;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x61CA;&#x607C;&#x8D77;&#x6765;&#x3002;&#x4F46;&#x662F;&#x6211;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x53BB;&#x673A;&#x573A;&#x4E86;&#xFF0C;&#x6CA1;&#x65F6;&#x95F4;&#x8DDF;&#x4ED6;&#x4EEC;&#x7406;&#x8BBA;&#xFF0C;&#x800C;&#x4E14;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x534A;&#x4E2A;&#x6708;&#x6211;&#x6574;&#x4E2A;&#x7684;&#x5BB6;&#x5C31;&#x90FD;&#x8981;&#x4EA4;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E86;&#x3002;&#x8FD9;&#x4E48;&#x4E00;&#x60F3;&#xFF0C;&#x6211;&#x53C8;&#x5FCD;&#x4F4F;&#x4E86;&#x6012;&#x6C14;&#xFF0C;&#x53EA;&#x662F;&#x7ED9;&#x5979;&#x53D1;&#x9001;&#x4E86;&#x4E00;&#x6761;&#x7559;&#x8A00;&#xFF1A;</p>
<p>&#x201C;&#x4EB2;&#xFF0C;&#x6211;&#x4ECA;&#x5929;&#x5C31;&#x8981;&#x8D70;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x534A;&#x4E2A;&#x6708;&#x6211;&#x7684;&#x5BB6;&#x5C31;&#x9EBB;&#x70E6;&#x4F60;&#x4EEC;&#x591A;&#x591A;&#x7167;&#x770B;&#x4E86;&#x3002;&#x4F60;&#x4EEC;&#x7684;&#x732B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5B9A;&#x8981;&#x51FA;&#x6765;&#x6D3B;&#x52A8;&#x7684;&#x8BDD;&#xFF0C;&#x8BB0;&#x5F97;&#x8981;&#x7167;&#x770B;&#x597D;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x5B83;&#x4EEC;&#x6293;&#x4E1C;&#x897F;&#x54E6;&#x3002;&#x90A3;&#x4E9B;&#x690D;&#x7269;&#xFF0C;&#x5B83;&#x4EEC;&#x5BF9;&#x6211;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x548C;&#x4F60;&#x7684;&#x732B;&#x5BF9;&#x4F60;&#x7684;&#x610F;&#x4E49;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x7406;&#x89E3;&#xFF0C;&#x52A1;&#x8BF7;&#x591A;&#x591A;&#x7167;&#x770B;&#xFF0C;&#x8C22;&#x8C22;&#x5566;&#xFF01;&#x201D;</p>
<p>&#x201C;&#x597D;&#x7684;&#x3002;&#x201D;&#x56DE;&#x590D;&#x53EA;&#x6709;&#x77ED;&#x77ED;&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x3002;</p>
<p>&#x6211;&#x6709;&#x4E9B;&#x4E0D;&#x5B89;&#x5730;&#x4E0A;&#x4E86;&#x98DE;&#x673A;&#x3002;</p>
<p>&#x5728;&#x56FD;&#x5916;&#x671F;&#x95F4;&#xFF0C;&#x5BB6;&#x4F4F;&#x5408;&#x80A5;&#x7684;&#x597D;&#x53CB;&#x6B63;&#x597D;&#x8981;&#x53BB;&#x4E0A;&#x6D77;&#x770B;&#x6B4C;&#x661F;&#x739B;&#x4E3D;&#x4E9A;&#x51EF;&#x8389;&#x7684;&#x6F14;&#x5531;&#x4F1A;&#xFF0C;&#x95EE;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4F4F;&#x6211;&#x5BB6;&#x6C11;&#x5BBF;&#x3002;</p>
<p>&#x201C;&#x6C11;&#x5BBF;&#x6709;&#x5BA2;&#x4EBA;&#x4E86;&#xFF0C;&#x201D;&#x6211;&#x8BF4;&#xFF0C;&#x201C;&#x4E0D;&#x8FC7;&#x4F60;&#x5012;&#x662F;&#x53EF;&#x4EE5;&#x4F4F;&#x6211;&#x7684;&#x623F;&#x95F4;&#xFF0C;&#x6211;&#x4E0D;&#x5728;&#x5BB6;&#x3002;&#x201D;</p>
<p>&#x597D;&#x53CB;&#x6EE1;&#x5FC3;&#x6B22;&#x559C;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x53BB;&#x4E86;&#xFF0C;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x5E2E;&#x6211;&#x770B;&#x770B;&#x5BB6;&#xFF0C;&#x6D47;&#x6D47;&#x82B1;&#x626B;&#x626B;&#x5730;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x5BB6;&#x90A3;&#x4E24;&#x4F4D;&#x5BA2;&#x4EBA;&#x628A;&#x5BB6;&#x91CC;&#x5F04;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x4E86;&#x3002;&#x201D;&#x6211;&#x8BF4;&#xFF0C;&#x201C;&#x5BF9;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x6709;&#x4E24;&#x53EA;&#x732B;&#x3002;&#x201D;</p>
<p>&#x201C;&#x53EA;&#x662F;&#x2026;&#x2026;&#x201D;&#x597D;&#x53CB;&#x8E1F;&#x8E70;&#x9053;&#xFF0C;&#x201C;&#x6211;&#x4E00;&#x4E2A;&#x5973;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x6015;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x574F;&#x4EBA;&#x5427;&#xFF1F;&#x201D;</p>
<p>&#x6211;&#x65E0;&#x5FC3;&#x6B23;&#x8D4F;&#x773C;&#x524D;&#x65B0;&#x82F1;&#x683C;&#x5170;&#x7684;&#x79CB;&#x666F;&#xFF0C;&#x4E49;&#x6B63;&#x4E25;&#x8F9E;&#x5730;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x8FD9;&#x6B21;&#x662F;&#x4EE3;&#x8868;&#x6211;&#x51FA;&#x73B0;&#x5728;&#x6211;&#x7684;&#x5BB6;&#x91CC;&#x7684;&#xFF0C;&#x4F60;&#x662F;&#x4E3B;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x5BA2;&#x4EBA;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x6015;&#x4ED6;&#x4EEC;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x4ED6;&#x4EEC;&#x6015;&#x4F60;&#x624D;&#x5BF9;&#xFF01;&#x201D;</p>
<p>&#x6211;&#x628A;&#x6211;&#x6709;&#x670B;&#x53CB;&#x8981;&#x6765;&#x5BB6;&#x4E2D;&#x5165;&#x4F4F;&#x8FD9;&#x4EF6;&#x4E8B;&#x63D0;&#x524D;&#x544A;&#x8BC9;&#x4E86;&#x6211;&#x7684;&#x5BA2;&#x4EBA;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x597D;&#x53CB;&#x901A;&#x8FC7;&#x8D8A;&#x6D0B;&#x89C6;&#x9891;&#x5411;&#x6211;&#x8FDC;&#x7A0B;&#x5C55;&#x793A;&#x4E86;&#x5BB6;&#x4E2D;&#x60C5;&#x666F;&#xFF0C;&#x5E76;&#x6089;&#x5FC3;&#x5E2E;&#x6211;&#x6536;&#x62FE;&#x505C;&#x5F53;&#x3002;&#x6211;&#x7565;&#x653E;&#x5FC3;&#x3002;</p>
<p>&#x201C;&#x53EA;&#x662F;&#x90A3;&#x4E2A;&#x5973;&#x7684;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x623F;&#x95F4;&#x91CC;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x4E0D;&#x65B9;&#x4FBF;&#x67E5;&#x770B;&#x5BA2;&#x623F;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x201D;&#x597D;&#x53CB;&#x8865;&#x5145;&#x9053;&#x3002;</p>
<p>&#x56DE;&#x56FD;&#x65F6;&#x95F4;&#x7EC8;&#x4E8E;&#x5230;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x8FDB;&#x5BB6;&#x95E8;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x6211;&#x5C31;&#x5DF2;&#x7ECF;&#x505A;&#x597D;&#x4E86;&#x6700;&#x574F;&#x7684;&#x5FC3;&#x7406;&#x51C6;&#x5907;&#xFF0C;&#x4F46;&#x773C;&#x524D;&#x666F;&#x8C61;&#x4F9D;&#x7136;&#x52FE;&#x8D77;&#x6211;&#x7684;&#x6012;&#x706B;&#x3002;&#x88AB;&#x732B;&#x722A;&#x6320;&#x8FC7;&#x7684;&#x7EFF;&#x841D;&#x53F6;&#x5B50;&#x5DF2;&#x7ECF;&#x67AF;&#x6B7B;&#x53D1;&#x9ED1;&#x4E86;&#xFF0C;&#x7F29;&#x5FAE;&#x5C0F;&#x63D0;&#x7434;&#x7EAA;&#x5FF5;&#x54C1;&#x6574;&#x4E2A;&#x7FFB;&#x8FC7;&#x6765;&#xFF0C;&#x7434;&#x5F13;&#x4E0D;&#x7FFC;&#x800C;&#x98DE;&#xFF0C;&#x67AF;&#x5C71;&#x6C34;&#x4E0A;&#x7684;&#x6C34;&#x7EB9;&#x5DF2;&#x7ECF;&#x9762;&#x76EE;&#x5168;&#x975E;&#xFF0C;&#x767D;&#x8272;&#x7684;&#x6C99;&#x5B50;&#x6CFC;&#x6D12;&#x51FA;&#x6765;&#xFF0C;&#x67DC;&#x5B50;&#x5730;&#x677F;&#x4E0A;&#x5230;&#x5904;&#x90FD;&#x662F;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x536B;&#x751F;&#x95EE;&#x9898;&#x6211;&#x5C31;&#x4E0D;&#x63D0;&#x4E86;&#x2014;&#x2014;&#x6211;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#x4E00;&#x4E2A;&#x4E0D;&#x7231;&#x5E72;&#x51C0;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x80FD;&#x5FCD;&#x53D7;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x5151;&#x73B0;&#x627F;&#x8BFA;&#xFF0C;&#x800C;&#x4E14;&#x72AF;&#x9519;&#x540E;&#x65E0;&#x4E1D;&#x6BEB;&#x9053;&#x6B49;&#x884C;&#x4E3A;&#x548C;&#x6127;&#x759A;&#x4E4B;&#x5FC3;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#x6211;&#x65E9;&#x65E9;&#x5730;&#x8D77;&#x6765;&#x6536;&#x62FE;&#x623F;&#x95F4;&#x3002;&#x5982;&#x597D;&#x53CB;&#x89C6;&#x9891;&#x4E2D;&#x6240;&#x8A00;&#xFF0C;&#x7537;&#x5B69;&#x5DF2;&#x7ECF;&#x4E0A;&#x73ED;&#x53BB;&#x4E86;&#xFF0C;&#x5973;&#x5B69;&#x8FD8;&#x5728;&#x623F;&#x95F4;&#x91CC;&#x3002;&#x2014;&#x2014;&#x6211;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E2A;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x5927;&#x5FD9;&#x4EBA;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x51E0;&#x4E4E;&#x6BCF;&#x5929;24&#x5C0F;&#x65F6;&#x90FD;&#x5728;&#x5BB6;&#x3002;</p>
<p>&#x5927;&#x7EA6;&#x5341;&#x70B9;&#x5DE6;&#x53F3;&#x5979;&#x51FA;&#x6765;&#x6D17;&#x6F31;&#xFF0C;&#x6211;&#x4E3B;&#x52A8;&#x8DDF;&#x5979;&#x6253;&#x4E86;&#x4E2A;&#x62DB;&#x547C;&#xFF0C;&#x95EE;&#x5979;&#x6709;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x804A;&#x4E00;&#x804A;&#x3002;&#x5979;&#x6D17;&#x4E86;&#x4E2A;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x6FA1;&#xFF0C;&#x6700;&#x540E;&#x7A7F;&#x7740;&#x6D74;&#x888D;&#x6E7F;&#x7740;&#x5979;&#x5218;&#x80E1;&#x5170;&#x4E00;&#x822C;&#x7684;&#x5934;&#x53D1;&#x4E24;&#x624B;&#x53C9;&#x8170;&#x5730;&#x51FA;&#x73B0;&#x5728;&#x6211;&#x7684;&#x95E8;&#x53E3;&#x3002;</p>
<p>&#x201C;&#x6211;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x51FA;&#x53BB;&#x4E86;&#xFF0C;&#x4F60;&#x8981;&#x804A;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x5C31;&#x804A;&#x804A;&#x4F60;&#x4EEC;&#x662F;&#x5426;&#x8FD8;&#x8981;&#x7EED;&#x4F4F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E24;&#x5929;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x4EEC;&#x7684;&#x9000;&#x623F;&#x65E5;&#x5F00;&#x59CB;&#xFF0C;&#x5DF2;&#x7ECF;&#x8FDE;&#x7EED;&#x4E09;&#x5929;&#x90FD;&#x6709;&#x5176;&#x4ED6;&#x5BA2;&#x4EBA;&#x9884;&#x8BA2;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x201C;&#x6211;&#x4EEC;&#x8FD8;&#x60F3;&#x7EE7;&#x7EED;&#x4F4F;&#x3002;&#x201D;&#x5979;&#x8BF4;&#xFF0C;&#x63A5;&#x7740;&#x8DDF;&#x6211;&#x8BF4;&#x4E86;&#x4E00;&#x5927;&#x5806;&#x5979;&#x5BB6;&#x88C5;&#x4FEE;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x88C5;&#x4FEE;&#x961F;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x62D6;&#x5EF6;&#xFF0C;&#x4E2D;&#x4ECB;&#x5E73;&#x53F0;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x63A8;&#x5378;&#x8D23;&#x4EFB;&#x7B49;&#x7B49;&#x4E4B;&#x7C7B;&#x3002;&#x6211;&#x65E0;&#x6687;&#x542C;&#x5979;&#x5570;&#x55E6;&#xFF0C;&#x8BF4;&#xFF1A;&#x201C;&#x90A3;&#x540E;&#x9762;&#x7684;&#x5BA2;&#x4EBA;&#x90FD;&#x5DF2;&#x7ECF;&#x9884;&#x8BA2;&#x4E86;&#xFF0C;&#x4F60;&#x4EEC;&#x5FC5;&#x987B;&#x5F97;&#x642C;&#x8D70;&#x3002;&#x201D;</p>
<p>&#x201C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF7;&#x4ED6;&#x53D6;&#x6D88;&#x3002;&#x201D;&#x5979;&#x7406;&#x76F4;&#x6C14;&#x58EE;&#x5730;&#x8BF4;&#xFF0C;&#x201C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x65B9;&#x4FBF;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x7535;&#x8BDD;&#x7ED9;&#x6211;&#xFF0C;&#x6211;&#x6765;&#x8DDF;&#x4ED6;&#x8BF4;&#x3002;&#x201D;</p>
<p>&#x201C;&#x53EF;&#x4ED6;&#x4EEC;&#x662F;&#x4E09;&#x4F4D;&#x4E0D;&#x540C;&#x7684;&#x5BA2;&#x4EBA;&#x3002;&#x201D;&#x6211;&#x8BF4;&#xFF0C;&#x201C;&#x4F60;&#x80FD;&#x8BF4;&#x670D;&#x4E00;&#x4F4D;&#xFF0C;&#x4F60;&#x80FD;&#x540C;&#x65F6;&#x8BF4;&#x670D;&#x4E09;&#x4F4D;&#x90FD;&#x53D6;&#x6D88;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x554A;&#xFF1F;&#x4E09;&#x4F4D;&#xFF1F;&#x201D;&#x5979;&#x8BE7;&#x5F02;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x63A5;&#x7740;&#x53C8;&#x6062;&#x590D;&#x4E86;&#x9762;&#x4E0D;&#x6539;&#x8272;&#x7684;&#x8868;&#x60C5;&#xFF0C;&#x201C;&#x6211;&#x53EF;&#x4EE5;&#xFF0C;&#x8BF7;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x7535;&#x8BDD;&#x90FD;&#x7ED9;&#x6211;&#x5427;&#x3002;&#x201D;</p>
<p>&#x6211;&#x628A;&#x5BA2;&#x4EBA;&#x7684;&#x7535;&#x8BDD;&#x90FD;&#x7ED9;&#x4E86;&#x5979;&#xFF0C;&#x4E00;&#x5FC3;&#x4EE5;&#x4E3A;&#x5979;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;</p>
<p>&#x5979;&#x5750;&#x5230;&#x6C99;&#x53D1;&#x4E0A;&#xFF0C;&#x5F00;&#x59CB;&#x9532;&#x800C;&#x4E0D;&#x820D;&#x5730;&#x9010;&#x4E2A;&#x529D;&#x8BF4;&#x90A3;&#x4E09;&#x4F4D;&#x5BA2;&#x4EBA;&#x53D6;&#x6D88;&#x6211;&#x5BB6;&#x6C11;&#x5BBF;&#x7684;&#x9884;&#x8BA2;&#x3002;&#x7535;&#x8BDD;&#x91CC;&#x5979;&#x63CF;&#x8FF0;&#x4E86;&#x6211;&#x623F;&#x6E90;&#x7684;&#x8BF8;&#x591A;&#x7F3A;&#x70B9;&#xFF0C;&#x5982;&#x4EA4;&#x901A;&#x4E0D;&#x4FBF;&#xFF0C;&#x53BB;&#x5F80;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x90FD;&#x5F88;&#x8FDC;&#xFF0C;&#x8FD8;&#x6709;&#x5408;&#x4F4F;&#x4E0D;&#x80FD;&#x4FDD;&#x969C;&#x9690;&#x79C1;&#x4E4B;&#x7C7B;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x542C;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x8BF4;&#xFF01;&#x201D;&#x6211;&#x6253;&#x65AD;&#x4E86;&#x5979;&#x7684;&#x7535;&#x8BDD;&#x3002;&#x201C;&#x4F60;&#x8981;&#x8BF4;&#x5B9E;&#x60C5;&#xFF01;&#x8981;&#x8BF7;&#x4ED6;&#x4EEC;&#x53D6;&#x6D88;&#x7684;&#x4EBA;&#x662F;&#x4F60;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6211;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x7535;&#x8BDD;&#x91CC;&#x63CF;&#x8FF0;&#x7684;&#x6211;&#x623F;&#x6E90;&#x7684;&#x5F88;&#x591A;&#x7F3A;&#x70B9;&#x5E76;&#x4E0D;&#x5C5E;&#x5B9E;&#x3002;&#x201D;</p>
<p>&#x5979;&#x6CA1;&#x6709;&#x7406;&#x4F1A;&#xFF0C;&#x4E0D;&#x6253;&#x7535;&#x8BDD;&#x4E86;&#xFF0C;&#x6539;&#x4F5C;&#x53D1;&#x77ED;&#x4FE1;&#x3002;</p>
<p>&#x5F53;&#x5979;&#x6210;&#x529F;&#x5730;&#x529D;&#x8BF4;&#x5B8C;&#x4E24;&#x4F4D;&#x5BA2;&#x4EBA;&#x53D6;&#x6D88;&#x8BA2;&#x5355;&#x65F6;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x6709;&#x4E9B;&#x5750;&#x4E0D;&#x4F4F;&#x4E86;&#x3002;&#x6211;&#x901A;&#x8FC7;&#x5E73;&#x53F0;&#x79C1;&#x4FE1;&#x544A;&#x8BC9;&#x4E86;&#x7B2C;&#x4E09;&#x4F4D;&#x5165;&#x4F4F;&#x5BA2;&#x4EBA;&#x6211;&#x7684;&#x7535;&#x8BDD;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8BF1;&#x5BFC;&#x4ED6;&#x53D6;&#x6D88;&#x7684;&#x7535;&#x8BDD;&#x90FD;&#x4E0D;&#x8981;&#x7406;&#x4F1A;&#xFF0C;&#x90A3;&#x4E0D;&#x662F;&#x6211;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x4F4D;&#x5BA2;&#x4EBA;&#x5FC3;&#x9886;&#x795E;&#x4F1A;&#x3002;</p>
<p>&#x201C;&#x90A3;&#x5979;&#x662F;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x6211;&#x7684;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x7684;&#x5462;&#xFF1F;&#x201D;&#x7B2C;&#x4E09;&#x4F4D;&#x5BA2;&#x4EBA;&#x95EE;&#x3002;</p>
<p>&#x6211;&#x54D1;&#x53E3;&#x65E0;&#x8A00;&#x3002;&#x6211;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x5230;&#x6211;&#x662F;&#x505A;&#x4E86;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x5927;&#x7684;&#x9519;&#x4E8B;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x4E00;&#x9519;&#x518D;&#x9519;&#xFF01;&#x6B63;&#x56E0;&#x4E3A;&#x6211;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x5730;&#x5931;&#x5B88;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x624D;&#x5BFC;&#x81F4;&#x4ECA;&#x65E5;&#x4E4B;&#x5C40;&#x9762;&#x3002;</p>
<p>&#x6211;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x8FDC;&#x5728;&#x7EBD;&#x7EA6;&#x7684;&#x670B;&#x53CB;&#x8BC9;&#x8BF4;&#x6211;&#x7684;&#x82E6;&#x95F7;&#xFF0C;&#x61CA;&#x6094;&#x4E0D;&#x5DF2;&#x3002;</p>
<p>&#x201C;&#x5979;&#x8FD9;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x8BD5;&#x63A2;&#x4F60;&#x7684;&#x5E95;&#x7EBF;&#x3002;&#x201D;&#x670B;&#x53CB;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x96BE;&#x9053;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x4EBA;&#x5C31;&#x90FD;&#x8FD9;&#x4E48;&#x574F;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x6CAE;&#x4E27;&#x5730;&#x8BF4;&#xFF0C;&#x201C;&#x6211;&#x6BCF;&#x8BA9;&#x4E00;&#x6B65;&#xFF0C;&#x5979;&#x5FC5;&#x8FDB;&#x4E24;&#x6B65;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4E0D;&#x4F1A;&#x554A;&#xFF0C;&#x4F60;&#x4E4B;&#x524D;&#x62DB;&#x5F85;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x5BA2;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x90FD;&#x5F88;&#x597D;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x662F;&#x554A;&#xFF0C;&#x201D;&#x6211;&#x8BF4;&#xFF0C;&#x201C;&#x5979;&#x65E9;&#x5C31;&#x5DF2;&#x7ECF;&#x628A;&#x5979;&#x7684;&#x574F;&#x5448;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4ECE;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x5E26;&#x732B;&#x5165;&#x4F4F;&#xFF0C;&#x653E;&#x732B;&#x51FA;&#x6765;&#xFF0C;&#x5230;&#x5F3A;&#x884C;&#x8981;&#x6C42;&#x7EED;&#x4F4F;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x540E;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x5730;&#x529D;&#x9000;&#x6211;&#x7684;&#x540E;&#x7EED;&#x5BA2;&#x4EBA;&#xFF0C;&#x5979;&#x7684;&#x6240;&#x505A;&#x6240;&#x4E3A;&#x65E9;&#x5C31;&#x5DF2;&#x7ECF;&#x591A;&#x6B21;&#x89E6;&#x72AF;&#x4E86;&#x6211;&#x7684;&#x5E95;&#x7EBF;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x9009;&#x62E9;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#xFF0C;&#x5F97;&#x8FC7;&#x4E14;&#x8FC7;&#x3002;&#x201D;</p>
<p>&#x201C;&#x6211;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x660E;&#x5929;&#x4E00;&#x65E9;&#x6211;&#x5C31;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E0B;&#x6700;&#x540E;&#x901A;&#x7252;&#xFF0C;&#x8BF7;&#x4ED6;&#x4EEC;&#x8D70;&#x3002;&#x201D;&#x6211;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x62A5;&#x8B66;&#x3002;&#x201D;&#x670B;&#x53CB;&#x63D0;&#x9192;&#x4E86;&#x4E00;&#x53E5;&#x3002;</p>
<p>&#x534A;&#x591C;&#x91CC;&#x6211;&#x9192;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x56E0;&#x4E3A;&#x65F6;&#x5DEE;&#xFF0C;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x68A6;&#x91CC;&#x5DF2;&#x7ECF;&#x60F3;&#x597D;&#x4E86;&#x5BF9;&#x7B56;&#xFF0C;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x8981;&#x9192;&#x8FC7;&#x6765;&#x3002;&#x6211;&#x7ED9;&#x4E00;&#x4F4D;&#x597D;&#x670B;&#x53CB;&#x53D1;&#x53BB;&#x4FE1;&#x606F;&#xFF1A;&#x201C;&#x6211;&#x56DE;&#x56FD;&#x4E86;&#xFF0C;&#x4F60;&#x660E;&#x5929;&#x6709;&#x7A7A;&#x6765;&#x6211;&#x5BB6;&#x5750;&#x5750;&#x5417;&#xFF1F;&#x7ED9;&#x4F60;&#x5E26;&#x4E86;&#x534E;&#x76DB;&#x987F;&#x5DDE;&#x7684;&#x7279;&#x4EA7;&#x3002;&#x201D;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x670B;&#x53CB;&#x5982;&#x671F;&#x800C;&#x81F3;&#x3002;&#x4EBA;&#x9AD8;&#x9A6C;&#x5927;&#x7684;&#x4ED6;&#xFF0C;&#x662F;&#x4E13;&#x95E8;&#x5728;&#x4E00;&#x5BB6;&#x51FA;&#x79DF;&#x8F66;&#x516C;&#x53F8;&#x5904;&#x7406;&#x4E8B;&#x6545;&#x7EA0;&#x7EB7;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x505A;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x5BA2;&#x5385;&#x91CC;&#x4E00;&#x8FB9;&#x559D;&#x7740;&#x4ECE;&#x897F;&#x96C5;&#x56FE;&#x5E26;&#x56DE;&#x6765;&#x7684;&#x5496;&#x5561;&#xFF0C;&#x4E00;&#x8FB9;&#x5403;&#x7740;&#x6C34;&#x679C;&#x548C;&#x70B9;&#x5FC3;&#xFF0C;&#x79F0;&#x5144;&#x9053;&#x5F1F;&#xFF0C;&#x8C08;&#x7B11;&#x98CE;&#x751F;&#x3002;&#x6211;&#x7684;&#x90A3;&#x4F4D;&#x7537;&#x5BA2;&#x4EBA;&#x65E9;&#x5DF2;&#x4E0A;&#x73ED;&#x53BB;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5973;&#x5BA2;&#x4EBA;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x5728;&#x623F;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5BF9;&#x8BDD;&#x5979;&#x542C;&#x5F97;&#x4E00;&#x6E05;&#x4E8C;&#x695A;&#x3002;</p>
<p>&#x53C8;&#x8FC7;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x4E24;&#x4F4D;&#x5BA2;&#x4EBA;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x732B;&#x7EC8;&#x4E8E;&#x6084;&#x65E0;&#x58F0;&#x606F;&#x5730;&#x4ECE;&#x6211;&#x7684;&#x5BB6;&#x4E2D;&#x6D88;&#x5931;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x518D;&#x6B21;&#x6536;&#x62FE;&#x597D;&#x623F;&#x95F4;&#xFF0C;&#x51C6;&#x5907;&#x8FCE;&#x63A5;&#x4E0B;&#x4E00;&#x4F4D;&#x5BA2;&#x4EBA;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E6%B0%91%E5%AE%BF/">#民宿</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/08/22/zen-and-the-art-of-motorcycle-maintenance/">禅与摩托车维修艺术</a>
            
        </span>
    </div>
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 胡芍&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>




<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>